{"ID": "https://uk.trustpilot.com/review/dinodecking.co.uk", "URL": "https://www.dinodecking.co.uk", "Name": "Dino Decking", "Data": [{"Author": "lime tree landscaping ", "Headline": "We always supply and install Dino…", "Ranking": "5", "Review": "We always supply and install Dino decking products, great value and only being round the corner from where we are based it’s ideal if we run short on items", "ReviewDate": "2020-11-17T17:23:23+00:00"}, {"Author": "liz Igrm", "Headline": "Great service", "Ranking": "5", "Review": "We are very pleased with our purchase. The delivery was quick and the man that delivered it was very helpful when it came to unload-66 4mtr planks later he helped my husband which was very welcome.\nCan't wait to see in installed.", "ReviewDate": "2020-11-10T12:53:58+00:00"}, {"Author": "Janet", "Headline": "Great product", "Ranking": "5", "Review": "Great product  - friendly and helpful staff! Would recommend,", "ReviewDate": "2020-11-10T08:16:28+00:00"}, {"Author": "Louise Ann Harvey", "Headline": "Great value, good service and looking good.", "Ranking": "4", "Review": "Our decking arrived safely and was unloaded for us by a friendly driver who had driven over four hours to get it to us! It is now all laid and looks fantastic.", "ReviewDate": "2020-11-09T21:37:15+00:00"}, {"Author": "P Bennett", "Headline": "Fantastic service, and helpful driver", "Ranking": "5", "Review": "Fantastic service, extremely fast delivery, the delivery driver Andrew was extremely helpful and very polite, would recommend to anyone,", "ReviewDate": "2020-11-09T18:57:38+00:00"}, {"Author": "Jim Hainey", "Headline": "total magic service", "Ranking": "5", "Review": "total magic service,    trims i desperatly needed arrived next day,,, couldn b happer with service   price    delivery   5stars", "ReviewDate": "2020-11-09T14:51:41+00:00"}, {"Author": "Mr Baker", "Headline": "Product Quality", "Ranking": "5", "Review": "The quality of the product is excellent as was service provision for follow queries. The product lacks the basic instructions for construction and such would have been of assistance during the build process.", "ReviewDate": "2020-11-09T13:51:09+00:00"}, {"Author": "Rick", "Headline": "Customer service = dreadful", "Ranking": "1", "Review": "Such a shame, seems like a good product but horrible company. Spent £1600 on decking and needed one more piece. Purchased the additional piece and I required it to be cut for collection. Charged me £8 to cut. Cut in half and not in dimensions I needed and refused to give me a correctly cut piece until payment was made for the £8. One star is for the product.", "ReviewDate": "2020-11-05T14:11:27+00:00"}, {"Author": "SG", "Headline": "Quick delivery", "Ranking": "5", "Review": "Quick delivery", "ReviewDate": "2020-11-04T09:36:13+00:00"}, {"Author": "Phil T.", "Headline": "Good service", "Ranking": "4", "Review": "Delivered what I wanted quickly and efficiently.", "ReviewDate": "2020-11-03T21:07:46+00:00"}, {"Author": "Mr Henry Tanner", "Headline": "Cannot Praise this Company Enough 🌟🌟🌟🌟🌟", "Ranking": "5", "Review": "Cannot praise this Company Enough. There Customer Service was Excellent!!!!!!.\nFriendly Helpful Staff and So Very Efficient and Courteous throughout.\nSpecial Mention to Sarah and Richard in ensuring everything was just right for us.. \nI Would Highly Recommend this Company and the product.. Great Quality and very Keenly priced..\nWill use again !!!!!!! \nThank you 🌟🌟🌟🌟🌟\n5 Stars All The Way.. \nChristine and Harry Tanner.. / Clydebank...", "ReviewDate": "2020-11-03T17:23:40+00:00"}, {"Author": "paul winter", "Headline": "Amazing service", "Ranking": "5", "Review": "Amazing service , all calls answered promptly, delivery on time , the quality of the product is top class \nThank you", "ReviewDate": "2020-11-03T10:22:38+00:00"}, {"Author": "Abbi Gary", "Headline": "Poor after service", "Ranking": "3", "Review": "Products delivered in great time and price was great but the after service was very poor. Was sent post caps that were not the same colour and didn’t seem interested in sorting out the issue. Would probably pay a bit more to get better service elsewhere in the future", "ReviewDate": "2020-10-29T21:18:29+00:00"}, {"Author": "Robert Ashton ", "Headline": "Decking project", "Ranking": "5", "Review": "Dino decking were very professional.  Ordering was easy and the office very helpful when I required help.", "ReviewDate": "2020-10-14T07:59:30+00:00"}, {"Author": "James Brady", "Headline": "It could be improved", "Ranking": "4", "Review": "It would have been a definitive five stars,good product,pleasant and efficient staff,the only faults were collar at bottom of posts are different shade from the posts itself and fitting the balustrade was very time consuming ,a better system should be implemented.", "ReviewDate": "2020-10-14T07:38:51+00:00"}, {"Author": "N hardy", "Headline": "Its just the weightin time the material", "Ranking": "4", "Review": "Its just the weightin time the material\nIs excellent", "ReviewDate": "2020-10-12T15:10:54+00:00"}, {"Author": "Mr Messom", "Headline": "Good service although Covid did make…", "Ranking": "5", "Review": "Good service although Covid did make delivery a little long winded.Product looks good.", "ReviewDate": "2020-10-09T14:57:14+00:00"}, {"Author": "Mr John Bowhay", "Headline": "Not all products are in stock all of…", "Ranking": "1", "Review": "Not all products are in stock all of the time, so you need to plan your purchase well ahead. Once the delivery date was notified it was duly delivered on that day. The driver  was exceptionally cheerful and very helpful in bringing the lengths of planking to my job site - not simply leaving them at the side of the road. The product looks really good, and I am looking forward to its installation, I think it is going to look great.", "ReviewDate": "2020-10-06T15:20:52+00:00"}, {"Author": "Steve", "Headline": "Ordered 10 3m composite joints", "Ranking": "5", "Review": "Ordered 10 3m composite joints - great value/price and arrived next day - excellent service! Definetly would use Dino Decking again!", "ReviewDate": "2020-10-05T13:02:02+00:00"}, {"Author": "Ben Hides", "Headline": "I had items missing off my delivery…", "Ranking": "3", "Review": "I had items missing off my delivery which affected the arranged start date for my customer", "ReviewDate": "2020-10-03T17:42:57+00:00"}, {"Author": "Moira Lawson", "Headline": "Dino Decking have been really helpful…", "Ranking": "5", "Review": "Dino Decking have been really helpful with all my many questions before purchase. I ordered during lockdown and the service was still good. My decking is now complete and I’ll m very happy with it. Can’t say how it will wear but it seems good quality so I’m hopeful of many happy years. I would recommend as they were much cheaper than any other supplier I tried.", "ReviewDate": "2020-10-02T17:48:37+00:00"}, {"Author": "Garry Robertson", "Headline": "Happy Customer", "Ranking": "5", "Review": "Good price, excellent product maybe a little quicker delivery next time?? But it was free so cant complain.", "ReviewDate": "2020-10-02T17:41:47+00:00"}, {"Author": "Bill D (Edinburgh)", "Headline": "First Class Product/Excellent Company/…", "Ranking": "5", "Review": "Was undecided about laying a new composite decking area but got recommended Dino from a friend who had just managed to get his delivery before lockdown. Saw his completed job and this convinced me to go ahead. Had to wait about 8 weeks for delivery but this was purely because of lockdown/demand. Delivery was excellent, fork lift right into property. I was a few boards short from my order but Dino wasted no time in replenishing same. Overall, Dino is an excellent company to deal with, with an excellent product range. The product is a joy to work with and the hidden fasteners ensure an excellent finish.", "ReviewDate": "2020-10-01T16:00:30+00:00"}, {"Author": "Mrs James", "Headline": "very helpful and supportive with…", "Ranking": "4", "Review": "very helpful and supportive with pleasant delivery team. quick delivery of addition. thank you Dino", "ReviewDate": "2020-09-25T08:07:51+00:00"}, {"Author": "Ian Grant", "Headline": "Outstanding", "Ranking": "5", "Review": "I have installed 2 decks from Dino. On each occasion delivery was quick and the customer service excellent.\nThe material is good quality at a competitive price and straightforward to install. Finished deck is very attractive. I thoroughly recommend this company.", "ReviewDate": "2020-09-23T17:13:52+00:00"}, {"Author": "John Robinson", "Headline": "I ordered a large amount of decking on…", "Ranking": "5", "Review": "I ordered a large amount of decking on a Friday. It arrived the following Wednesday along with all the bullnose and fixings. Good quality product. i am very impressed. all I have to do now is fit it!", "ReviewDate": "2020-09-09T10:45:45+00:00"}, {"Author": "Ged & Amanda S", "Headline": "Good product, customer service could be improved.", "Ranking": "3", "Review": "The product seems to be of good quality and was easy to install. Looks really impressive, time will tell how it lasts as it has only been installed for a couple of weeks.\n\nCustomer service and communication needs to improve.\n\nConfirmation of the full order and delivery received via email only to be advised later that some of the order was actually not in stock and had an expected delivery of a month later.\n\nUnable to contact customer support via phone so emails the only option, some delay with replies.", "ReviewDate": "2020-09-07T12:32:56+00:00"}, {"Author": "Mr r Peters ", "Headline": "I have no option but to leave a bad…", "Ranking": "1", "Review": "I have no option but to leave a bad review for this company. Customer service have been shocking, I was having an email conversation with one person and had to prove I had returned items with the driver, which I did show the proof, since then I have had to send 3 emails via this person and via the website and still haven’t had a response or my refund which is very frustrating! \nHopefully someone from the company reads this and finally gets this resolved!", "ReviewDate": "2020-09-06T19:45:15+00:00"}, {"Author": "Paul v", "Headline": "Fantastic product,exactly what I was…", "Ranking": "5", "Review": "Fantastic product,exactly what I was hoping for  ,looks amazing now fitted .and delivery is free.i would definitely \nUse Dino again .\nTook longer than expected to arrive ,but due to covid I can appreciate the delay .", "ReviewDate": "2020-09-03T07:30:04+00:00"}, {"Author": "Harry Groves", "Headline": "Excellent Company", "Ranking": "5", "Review": "What superb quality at a great price. Very helpful and the delivery driver was amazingly helpful and polite. Well recommend them.", "ReviewDate": "2020-08-29T11:06:04+00:00"}, {"Author": "Denise Whittaker", "Headline": "Great service and product", "Ranking": "5", "Review": "I would like to thank the sales team at Dino Decking. They were very helpful on both of the orders I made. The webside is easy to use and the product is much better then stock I've used from elsewhere.", "ReviewDate": "2020-08-27T17:41:19+00:00"}, {"Author": "L. Lockwood", "Headline": "Excellent service from start to finish", "Ranking": "5", "Review": "Excellent service from start to finish. Website easy to navigate and place orders. Very well priced and product is of excellent standard. Cannot fault customer services and delivery driver very helpful. I would highly recommend.  Well done", "ReviewDate": "2020-08-25T15:00:40+00:00"}, {"Author": "alan leiper", "Headline": "Good pricing", "Ranking": "5", "Review": "Good pricing, Quick delivery of order. Product looks very good.", "ReviewDate": "2020-08-12T14:37:22+00:00"}, {"Author": "Ted Bassett-Myers", "Headline": "An excellent service", "Ranking": "5", "Review": "An excellent service, prompt and efficient and kept me updated throughout the process - definitely a Five Star Company!!!", "ReviewDate": "2020-08-12T07:09:33+00:00"}, {"Author": "Michael Knight", "Headline": "5* for quality decking at a great…", "Ranking": "5", "Review": "5* for quality decking at a great price, I will and have recommended Dino to friends and family.", "ReviewDate": "2020-08-11T13:56:42+00:00"}, {"Author": "Peter Anand", "Headline": "Excellent service and product’s seems…", "Ranking": "5", "Review": "Excellent service and product’s seems very good.\nWill order soon", "ReviewDate": "2020-08-05T13:17:49+00:00"}, {"Author": "Andy ", "Headline": "Great quality and looks.", "Ranking": "4", "Review": "Overall extremely happy with my decking. I fitted it myself after building the decking frame. The fitting is good, very easy to follow. The overall look and finish is fantastic. The decking have moved slightly since install so I have had to secure it with a couple of well placed screws to stop it from moving which is the only reason it isn't a 5/5. I would certainly recommend to others.", "ReviewDate": "2020-08-05T12:16:14+00:00"}, {"Author": "Val Prescott", "Headline": "Best samples and competitive prices", "Ranking": "5", "Review": "I received samples from a number of companies but was very impressed with the samples from Dino Decking. I was also very impressed with the comprehensive brochure that came too. Very competitive prices and all clearly priced in brochure. I ordered the decking which arrived within promised time. The delivery driver was great. I am really pleased with the way the decking looks. I will be sending photos when all complete. It just looks so good. I found that the 3mm clips were not brilliant however, and not as easy to use as stated.", "ReviewDate": "2020-08-05T11:29:50+00:00"}, {"Author": "Lee Carruthers", "Headline": "Great product", "Ranking": "5", "Review": "Great product, will be hopefully placing an order soon", "ReviewDate": "2020-08-04T16:16:30+00:00"}, {"Author": "Patrick Quinn", "Headline": "Fast delivery and quality product", "Ranking": "5", "Review": "Fast delivery and quality product", "ReviewDate": "2020-08-04T15:56:41+00:00"}, {"Author": "Dariusz Dabrowski", "Headline": "I was order from DINO Decking some…", "Ranking": "4", "Review": "I was order from DINO Decking some composite decking in May for more then £500 and still have not delivery.\n\nAfter After writing the above opinion, the DINO company started to operate and after 2 weeks I received my dream decking. Very good quality.", "ReviewDate": "2020-07-28T23:02:35+00:00"}, {"Author": "Lesley lloyd", "Headline": "Think twice before you order ...", "Ranking": "1", "Review": "Thank you for responding to my post below.  It doesn’t change The fact that that we were informed by you on the Friday afternoon that the decking would not be delivered the following week It was too late For us to change our annual leave the following week. Surely you would have known before then. So annoyed it’s still not finished as we don’t have any more leave left.  NOT GOOD BUSINESS PRACTICE DINO\nOrdered decking at least ten weeks ago, totally understand the difficulties encountered for organisations due to COVID-19 so we have been waiting patiently. They confirmed delivery the week commencing 27th July this was provided in an email.  The procedure was on the 24th July they would confirm via email the exact date and time.  I received  an email on the afternoon of the 24th July to say It’s been delayed a week.  NOT GOOD ENOUGH DINO we have both taken annual leave that we can’t change at this late stage and arranged for additional help. How long have they known they can’t get it to us for next week? It’s been paid for all these weeks as well.  It’s not fair we are back in work the week it’s due.  We are bitterly upset and very annoyed with the company.  I hope when we eventually get it it’s worth it.  NOT happy customers. GET YOUR ACT TOGETHER DINO DECKING", "ReviewDate": "2020-07-24T14:58:32+00:00"}, {"Author": "Kp", "Headline": "Very quick with delivery", "Ranking": "5", "Review": "Very quick with delivery", "ReviewDate": "2020-07-10T10:02:48+00:00"}, {"Author": "Chris Jackson", "Headline": "Excellent company to deal with", "Ranking": "5", "Review": "Excellent company to deal with. Great communication, prompt actions. Product line is great.  Built a 50 square deck from composite in slate grey. Looks fantastic. Highly recommended.", "ReviewDate": "2020-07-10T08:39:17+00:00"}, {"Author": "John Kinch", "Headline": "ave fitted decking supplied by Dino on…", "Ranking": "5", "Review": "Have fitted decking supplied by Dino on my house and for customer’s good quality decking and a good firm to do business with no problems john kinch", "ReviewDate": "2020-07-04T04:44:34+00:00"}, {"Author": "Ian Jones", "Headline": "Great product and great help from Kelly…", "Ranking": "5", "Review": "Great product and great help from Kelly during the ordering process.", "ReviewDate": "2020-07-03T15:30:56+00:00"}, {"Author": "Nigel Frederick Steljes", "Headline": "No sample pack yet?…", "Ranking": "4", "Review": "First sample pack didn't arrive but second pack has and I will now be measuring up for my deck?", "ReviewDate": "2020-07-03T11:40:39+00:00"}, {"Author": "Steven_Lovell", "Headline": "If you have a comments section, please read and fulfill it!", "Ranking": "3", "Review": "Wrote a comment regarding order in the comments section and this has been completely missed which means without this sample I asked for, the order I had in mind of ordering may not go ahead as I require this sample specifically to make sure everything fits together as I want it too.  Real shame as it looks like a good product.", "ReviewDate": "2020-07-03T09:55:38+00:00"}, {"Author": "DarranJones", "Headline": "Decking clips", "Ranking": "5", "Review": "Great product great customer service", "ReviewDate": "2020-07-03T08:31:31+00:00"}, {"Author": "Mark Davies", "Headline": "Delivered on date stated at order and…", "Ranking": "5", "Review": "Delivered on date stated at order and four items which were damaged were replaced the following day.", "ReviewDate": "2020-07-01T21:43:42+00:00"}, {"Author": "James Tose", "Headline": "Fantastic service from Dino Decking ..", "Ranking": "5", "Review": "Fantastic service from Dino Decking ... the quality of the decking is very good and customer service was top class. During the fitting of my decking I came across a couple of issues and needed help. I found the staff at Dino Decking were very helpful and flexible and my wife and I were extremely grateful for all the assistance they gave us . I would definitely recommend this company! Thank you Dino Decking", "ReviewDate": "2020-06-23T14:09:37+00:00"}, {"Author": "Graham Bellamy", "Headline": "Poor Quality", "Ranking": "1", "Review": "Had decking laid two years ago.  It has now warped, cracked faded, shrunk and expanded. Very poor quality.  Limited warranty not worth paper written on. Buyer beware.  \nNow ripped up and relaying with slabs. So disappointed as not cheap.", "ReviewDate": "2020-06-20T13:49:54+00:00"}, {"Author": "Dave Pengilley ", "Headline": "Just like to say I was delighted with…", "Ranking": "5", "Review": "Just like to say I was delighted with my order of Dino decking i received it earlier than expected which was a delightful surprise the quality is really excellent also the friendly manner of the delivery driver while observing our distances was really good a boon to the company I would say thank you Dino Decking", "ReviewDate": "2020-06-16T20:31:46+00:00"}, {"Author": "Andy - Northampton", "Headline": "So far so good", "Ranking": "4", "Review": "So far so good. Not due to receive the decking for another 3-4 weeks, not a problem though as I anticipated a longer lead time given the current troubled times. Also currently their phones aren't manned, which isn't their fault, so all communication is via email.\nI was a little concerned when the only email I got in my inbox was one asking me to review their service. Totally my fault, I didn't think to check Junk email folder, still not sure why the order confirmation went there and the marketing email came straight to my inbox though!\n\nWill post another review when the goods arrive and Ive gor them installed.", "ReviewDate": "2020-06-12T08:52:43+00:00"}, {"Author": "Ian", "Headline": "Difficult customer service", "Ranking": "1", "Review": "+Ves: \n1. Decking is good with good fixings (exactly same decking as many independants); and\n2. Price - cheapest I found\n\n-Ves: Customer Service!\nI made a substantial order, but after installation found I was a couple of boards short. I ordered additional boards online on click and collect system due to orders not being taken any other way now due to lockdown. I was then informed I was only able to collect order in 4 weeks due to orders being made in date order. Didn't matter my project then sat idle for this time when could be have been completed with happy customer. I was advised when making my original order (ordered at the premises with their staff) to get 2 bags (200) of hidden starters. You won't need anything like this! I used no more than 10!!! However, due to the pandemic most places were not taking returns until lockdown had eased, so I assumed the same would be true with Dino. However, when I contacted them to enquire about this as the items were delivered 6.5 weeks earlier I was informed I was outside their 4 week return policy and so they wouldn't accept them! Frustrating as no flexibility was offered, which was unusual as nearly every other supplier I dealt with during this time were being flexible. The click and collect wouldn't also allow me to book collection weeks in advance and so I was informed I had to recontact when the new stock arrived. I contacted days in advance of the proposed arrival and didn't receive a reply for 3 working days! When I did, I asked to be booked on the earliest collection so we could eventually get the project finished. This request was made on the Monday morning...I was given a Friday collection!! Sorry, just felt throughout like they were on a power trip and they were going out of their way to be as difficult as possible as they knew with over 35m2 already bought and fitted I couldn't do anything else. Very frustrating experience and one to be aware of.", "ReviewDate": "2020-06-10T13:52:55+00:00"}, {"Author": "Fiona Donnelly", "Headline": "Fantastic service from viewing the…", "Ranking": "5", "Review": "Fantastic service from viewing the website, to getting samples, order and delivery\nGreat customer service every step of the way\nWould have no hesitation in using them again or recommending them to friends and family", "ReviewDate": "2020-06-10T12:04:10+00:00"}, {"Author": "David Sargent", "Headline": "Plastic Decking, Cedar Colour", "Ranking": "5", "Review": "After my initial complaint of one piece of cracked composite cedar coloured decking. I have now been contacted by Matthew at Dino decking, via email.  I found that Matthew at Dino was extremely helpful. As a gesture of goodwill, they have now ordered a new decking piece, which will arrive next week. \n\nI would certainly use Dino Decking in Wigan again.\n\nMr Sargent", "ReviewDate": "2020-06-10T11:37:02+00:00"}, {"Author": "rad Caushllari", "Headline": "Very good", "Ranking": "5", "Review": "Very good stuff and fast delivery", "ReviewDate": "2020-06-09T17:55:04+00:00"}, {"Author": "Alison ", "Headline": "Fast", "Ranking": "5", "Review": "Fast, reliable service. The only issue I had was that it couldn’t be dropped off behind my gate but this was explained in advance so no biggie!!", "ReviewDate": "2020-06-09T13:22:44+00:00"}, {"Author": "David Pye", "Headline": "Great Service and delivered fast", "Ranking": "5", "Review": "Great Service and delivered fast", "ReviewDate": "2020-06-09T12:13:33+00:00"}, {"Author": "Terence", "Headline": "Great company", "Ranking": "5", "Review": "Great company. Good product. Friendly staff.\nWould recomend.", "ReviewDate": "2020-06-09T11:47:04+00:00"}, {"Author": "Kevin", "Headline": "Brilliant Service...", "Ranking": "5", "Review": "Had lots of problems with another decking company (Cladco) who had messed me around for over 4 weeks so cancelled my order with them and found Dino Decking online - so glad I did.  Ordered 83 boards on the 2nd June, received delivery date 3 days later and order arrived today - all within 7 days..!! Product looks great quality and Courier was very helpful, all in all great service and will definitely use again.", "ReviewDate": "2020-06-09T10:52:39+00:00"}, {"Author": "Tomasz Topolewski", "Headline": "price and material", "Ranking": "5", "Review": "price and material", "ReviewDate": "2020-06-08T14:48:49+00:00"}, {"Author": "Dirk", "Headline": "Great product and company", "Ranking": "5", "Review": "Was helped personally by the company to ensure i ordered the correct materials. Arrived in a timely manner, delivered by a really helpful courier. Decking is great quality, looks fantastic and extremely good value.\nOften difficult to find a quality company that offers a great product with excellent customer service, particularly only using Google, but Dino Decking easily fits the bill. Highly recommended.", "ReviewDate": "2020-06-05T07:32:07+00:00"}, {"Author": "Martin", "Headline": "sample received as described", "Ranking": "5", "Review": "sample received as described, quality excellent.", "ReviewDate": "2020-06-02T18:24:57+00:00"}, {"Author": "David Perkin", "Headline": "Great product", "Ranking": "5", "Review": "Great product. Helped me decide.", "ReviewDate": "2020-06-02T12:38:30+00:00"}, {"Author": "Stephen Westmorland", "Headline": "Great decking", "Ranking": "5", "Review": "Great decking, great service", "ReviewDate": "2020-06-02T11:52:09+00:00"}, {"Author": "James Mitchinson", "Headline": "I rang at dinnertime and was told I…", "Ranking": "5", "Review": "I rang at dinnertime and was told I could pick my joists up at 4pm I didn't notice when I paid with my card that a delivery charge of £60 had been put on I sent an email and this was refunded within 4 days so thank you for prompt attention to my order and also my refund, James Mitchinson", "ReviewDate": "2020-06-02T11:42:38+00:00"}, {"Author": "mick DAVISON", "Headline": "Good solid product", "Ranking": "5", "Review": "Good solid product, excellent prompt delivery, will be using Dino again,\nIt's 5 stars from me,\nMick D", "ReviewDate": "2020-06-02T11:40:15+00:00"}, {"Author": "Annette Durkin", "Headline": "Fantastic company", "Ranking": "5", "Review": "Fantastic company. I ordered 36m squared of  decking. I received a very apologetic email to say the suppliers had sent the wrong colour. Dino Decking offered to upgrade my order to premium for no extra charge. The order arrived as scheduled. The decking is high quality and looks beautiful. Thank you to Dino Decking for a first class service.", "ReviewDate": "2020-05-24T19:00:54+00:00"}, {"Author": "John", "Headline": "Excellent customer service 5* service all round", "Ranking": "5", "Review": "Goods received today. Excellent 5* service from ordering to delivery even during current situation.\nEverything as ordered. Would not hesitate in recommending you to others.\nThanks and appreciate your attention in dealing with my order.\nDriver was professional .", "ReviewDate": "2020-05-21T15:34:03+00:00"}, {"Author": "Keith Gillman", "Headline": "Great product & great service", "Ranking": "5", "Review": "Great product & great service", "ReviewDate": "2020-05-16T11:55:35+00:00"}, {"Author": "Delid4ve", "Headline": "Not Up To The Job 8 Months On..", "Ranking": "2", "Review": "Not normally one to post reviews but this could save someone a lot of money.\nOrder / delivery was prompt and was initially happy with my purchase (silver).\nDecking has now been down for 8 months (mainly through winter) and I’m now regretting purchasing.  The decking has scratched and marked extremely easy. Anything that sits on the decking such as a leaf, a bit of mud from a bird dropping it causes staining which does not come out even with purpose made composite cleaners. Very disappointed in the quality and the seal of the boards (I have friends with other brands that don’t have this problem).\nThe fact they now have a premium range says to me that they are aware of this, hence the new which advertises stain and scratch resistant properties which has been cut from the existing range.\nSave a bit more and purchase a quality brand.", "ReviewDate": "2020-05-16T08:16:00+00:00"}, {"Author": "Mike Riggall", "Headline": "Very Happy!", "Ranking": "5", "Review": "Very Happy!\n\nDelivery exactly on schedule. Boards were excellent - no warping, twisting or bending to be seen. Easy to cut and work and very straightforward for a novice to fit. Looks great.", "ReviewDate": "2020-05-13T19:51:46+00:00"}, {"Author": "customer", "Headline": "Came when they said it would and was…", "Ranking": "5", "Review": "Came when they said it would and was what I ordered no problems", "ReviewDate": "2020-05-10T09:16:37+00:00"}, {"Author": "Robert Cooke", "Headline": "very pleased with Dino Decking", "Ranking": "5", "Review": "very pleased with Dino Decking. I phoned up and placed my order and paid for my decking. Was given a date for delivery. I then realised I had ordered to much so phoned to change my order. They altered my order and refunded the difference straight away with no argument. The order came right on time. Very impressed.", "ReviewDate": "2020-05-09T21:06:00+00:00"}, {"Author": "Dean", "Headline": "would definitely recommend....Excellent!", "Ranking": "5", "Review": "We didn’t buy decking from this company as we didn’t know about it at the time but we bought the hidden fasteners and they’re excellent. Easy to use and because they’re black they blend in well with the decking. Super fast delivery too. Would definitely recommend.", "ReviewDate": "2020-05-08T17:06:25+00:00"}, {"Author": "Greg Mcdonald", "Headline": "Quality!", "Ranking": "5", "Review": "Quality material and looks the part.\nShipping and delivery was speedy.\nCannot fault anything with the product or service.", "ReviewDate": "2020-05-08T12:54:21+00:00"}, {"Author": "Sophie Smith ", "Headline": "Very fast delivery", "Ranking": "5", "Review": "Very fast delivery", "ReviewDate": "2020-05-08T12:36:38+00:00"}, {"Author": "Aidan", "Headline": "Generally ok initially", "Ranking": "2", "Review": "Generally ok initially, once the items were delivered I experienced disappointing service when help was required with fittings and installation guides. Email responses were not very helpful !", "ReviewDate": "2020-05-06T17:51:32+00:00"}, {"Author": "Stephen Garner", "Headline": "Couldn't fault Dino Decking", "Ranking": "5", "Review": "Couldn't fault Dino Decking. Placed the order, had confirmation then delivery date. Driver rang me a couple of hours before with a time estimate and when he arrived went out of his way to put it exactly where my wife indicated. Placed a second order for some extra bits and they were dispatched quickly. All this just before and during the lockdown. Brilliant!", "ReviewDate": "2020-05-06T17:04:19+00:00"}, {"Author": "Steven Fisher", "Headline": "Great service excellent product", "Ranking": "5", "Review": "Great service excellent product", "ReviewDate": "2020-05-06T13:02:43+00:00"}, {"Author": "Dinko Monev", "Headline": "Excelllent service.", "Ranking": "5", "Review": "Excelllent service.", "ReviewDate": "2020-05-05T10:10:36+00:00"}, {"Author": "Mr Kenneth Lawrie", "Headline": "Excellent service", "Ranking": "5", "Review": "Excellent service from Dino Decking once again. Couldn’t fault them in any way👍", "ReviewDate": "2020-05-04T18:51:39+00:00"}, {"Author": "vicki king", "Headline": "Decking", "Ranking": "5", "Review": "Very happy with my decking, I will gladly recommend Dino Decking", "ReviewDate": "2020-05-04T18:03:14+00:00"}, {"Author": "Malcolm", "Headline": "Great product", "Ranking": "5", "Review": "Great product, very quick delivery.", "ReviewDate": "2020-05-04T09:05:39+00:00"}, {"Author": "james", "Headline": "Excellent service", "Ranking": "5", "Review": "Excellent service, great product and no concerns to report. \n\nWell priced compared to others. \n\nI would recommend to anyone without question.", "ReviewDate": "2020-05-03T20:38:17+00:00"}, {"Author": "Diane ", "Headline": "great service", "Ranking": "5", "Review": "Well it’s a pleasure when dealing with a firm to find they do what they say.\nWhole process was efficient and friendly.\n\nWish I needed another load of decking 😃👍🏻", "ReviewDate": "2020-05-02T09:02:18+00:00"}, {"Author": "Customer", "Headline": "Helpful with a quick delivery.", "Ranking": "5", "Review": "Really helpful service and nice quick delivery.  Wish I’d used the 6mm fixings instead of the 3mm as they were a bit fiddly and Don’t leave a very uniform gap. However I’m still really pleased with the finished product.", "ReviewDate": "2020-05-01T19:31:06+00:00"}, {"Author": "Steven ferguson", "Headline": "Steven Ferguson", "Ranking": "5", "Review": "Ordered my ash colored decking Couple of weeks ago  and it got delivered today 1/5/2020.  I’ve started fitting it today and believe me it’s going to look fantastic when finished.  The quality is excellent , the woodgrain on it looks better than real wood and not slippery at all.  Fixing it down is easy And straight forward, I’m so impressed with product, guys on phone when ordering and even the delivery driver John.  He gave me a call an hour before arriving and said he’d be there at 11.30 and guess what he arrived 11.30 exactly.  I stayed in the house as Asked due to the covid 19 situation at the moment and he uploaded everything onto my drive.  I can’t wait to see finished result.  \nThanks very much Dino decking \nA1 first class 👍", "ReviewDate": "2020-05-01T18:44:17+00:00"}, {"Author": "Neil Dembicki", "Headline": "Great communication and great service", "Ranking": "5", "Review": "Great communication and great service. Delivered as promised.", "ReviewDate": "2020-05-01T18:38:13+00:00"}, {"Author": "Stephen Lewtas", "Headline": "Excellent product great customer…", "Ranking": "5", "Review": "Excellent product great customer feedback", "ReviewDate": "2020-05-01T17:40:51+00:00"}, {"Author": "Matthew Rogers", "Headline": "Excellent product and great service .", "Ranking": "5", "Review": "Excellent product and great service .", "ReviewDate": "2020-05-01T12:03:32+00:00"}, {"Author": "Kevin Lock", "Headline": "Great product", "Ranking": "5", "Review": "Great product, great value, great service, i would totally recommend", "ReviewDate": "2020-05-01T11:25:33+00:00"}, {"Author": "Jane", "Headline": "Great company to deal with and quality…", "Ranking": "5", "Review": "Great company to deal with and quality products", "ReviewDate": "2020-05-01T08:40:27+00:00"}, {"Author": "John Harvey", "Headline": "Superb service and product !", "Ranking": "5", "Review": "Superb service and product ! We ordered from Dino Decking to complete a garden project having looked at other suppliers we found that the choice of colours and  finishes on the boards from Dino Decking,  the home sample pack and catologue made our decision easy  Delivery was on time and  when we needed some advice and extra parts they were happy to help.\nWe installed it ourselves and we are really pleased with the finished project, thankyou Dino Decking.", "ReviewDate": "2020-04-21T08:17:16+00:00"}, {"Author": "garden construction", "Headline": "great service and help", "Ranking": "5", "Review": "great service and help", "ReviewDate": "2020-04-15T09:33:28+00:00"}, {"Author": "David Wardman", "Headline": "Good product delivered on time  best …", "Ranking": "5", "Review": "Good product delivered on time  best  price  on the market  will  always  recommend", "ReviewDate": "2020-04-14T19:32:16+00:00"}, {"Author": "Ian Bainbridge", "Headline": "Great product", "Ranking": "5", "Review": "Great product, looks amazing. Got delivered in time despite the whole world going mad with corona", "ReviewDate": "2020-04-10T13:13:03+00:00"}, {"Author": "Nick Bailey", "Headline": "All arrived in good time and so far so good", "Ranking": "5", "Review": "All arrived in good time and delivery very courteous with prior phone call which always helps. Product easy to lay and looks great. Need some time now to settle in and see how it wears.", "ReviewDate": "2020-04-08T10:31:13+00:00"}, {"Author": "Martin Hall", "Headline": "Excellent service and delivery", "Ranking": "5", "Review": "Excellent service and delivery. Product looks good. Just waiting for the break at Easter to install when i'll give a further review. Cannot fault the process so far from the initial contact to the delivery date and time. I have researched  composite decking for some time now and if you want the woodgrain effect on a hollow board then this is the most competitive out there.\n\nFirst time user", "ReviewDate": "2020-04-08T07:18:41Z"}, {"Author": "andy davis", "Headline": "altogether very good delivery a little…", "Ranking": "4", "Review": "altogether very good delivery a little slow and the fixings were ver expensive at £110.00 to fit 15m2", "ReviewDate": "2020-04-05T10:16:51Z"}, {"Author": "david Allen", "Headline": "Fantastic quality decking,", "Ranking": "5", "Review": "Fantastic quality decking,delivered on time as promised.Would highly recommend.", "ReviewDate": "2020-04-03T23:58:34Z"}, {"Author": "Joan McLaren", "Headline": "5 stars for service and delivery…", "Ranking": "5", "Review": "5 stars for service and delivery driver. Looks amazing can’t wait to see it down. Thankyou", "ReviewDate": "2020-04-03T23:58:26Z"}, {"Author": "Steven Higgins", "Headline": "Came when the email said it was coming", "Ranking": "5", "Review": "Came when the email said it was coming. Very pleasant man who delivered aswell.", "ReviewDate": "2020-04-03T19:05:51Z"}, {"Author": "ian", "Headline": "Great service and product", "Ranking": "5", "Review": "Helpful in choosing the product and delivered as promised", "ReviewDate": "2020-04-03T15:02:54Z"}, {"Author": "Sandra Cafferty", "Headline": "Absolutely amazing the decking looks…", "Ranking": "5", "Review": "Absolutely amazing the decking looks fantastic . Plus excellent customer service, I hadn't a clue what to order but just sent the size of the area by email and a got a quote by return with everything I would need and the price. Very happy customer.", "ReviewDate": "2020-04-03T12:22:21Z"}, {"Author": "Darren Parker", "Headline": "brilliant service", "Ranking": "5", "Review": "brilliant service", "ReviewDate": "2020-04-03T11:00:07Z"}, {"Author": "Yasmin Waqi", "Headline": "Spot on!", "Ranking": "5", "Review": "Spot on!\nSpeedy delivery!\nreasonable price for quality items", "ReviewDate": "2020-04-03T10:43:30Z"}, {"Author": "John Callum", "Headline": "Exceptional company", "Ranking": "5", "Review": "When phone the response from Dino decking was excellent with information regarding the decking and instal \nAfter ordering the decking I was impressed with the speed of delivery from England to Scotland and also the delivery team who brought the product to myself \nWould highly recommend this company to anyone who is interested in top quality decking and help about instal", "ReviewDate": "2020-04-03T10:21:35Z"}, {"Author": "Graham S ", "Headline": "Absolutely brilliant service", "Ranking": "5", "Review": "Absolutely brilliant service, thank you. Sample pack came the next day. My questions were answered on the phone, patiently! Order came as promised. Driver friendly and helpful. One item was missing from order but after a phone call it was in the post and received a few days later, no questions. Product looks great, am in the process of fitting, is simple enough even for a DIYer!", "ReviewDate": "2020-04-02T14:37:06Z"}, {"Author": "Kevin - Suffolk", "Headline": "Excellent product at a great price", "Ranking": "5", "Review": "Excellent product at a great price, delivered on time. I couldn't recommend Dino Decking highly enough.", "ReviewDate": "2020-04-01T23:01:51Z"}, {"Author": "Mrs Linda Overall", "Headline": "Very pleased with the decking my…", "Ranking": "5", "Review": "Very pleased with the decking my husband laid it and looks amazing\nOne point I would make is we did not have enough materials so had to order some more the delivery charge was  £180.00 !!!! So a very expensive mistake make sure you measure correctly", "ReviewDate": "2020-03-29T08:43:18Z"}, {"Author": "SuE (Leicester)", "Headline": "Looks amazing just completed caravan…", "Ranking": "5", "Review": "Looks amazing just completed caravan decking", "ReviewDate": "2020-03-16T09:07:26Z"}, {"Author": "Happy Customer", "Headline": "Great product for my balcony.", "Ranking": "5", "Review": "Great product for my balcony.", "ReviewDate": "2020-03-13T16:00:11Z"}, {"Author": "Mrs Johnston", "Headline": "Good quality decking", "Ranking": "5", "Review": "Good quality decking, friendly staff will do business again thank you", "ReviewDate": "2020-03-13T15:47:26Z"}, {"Author": "Richard Parker", "Headline": "Thank you - quality product reasonably priced", "Ranking": "5", "Review": "Thank you - quality product!\nSo far I have had a very good experience all round with Dino Decking. Ordering the product was very simple and sales staff were very friendly and accommodating for our expedited delivery request.\nMyself and our decking installers were happy with the quality of the product they were installing.\nThe price was also very reasonable - approximately 1/3 to 1/2 cheaper than other comparable product samples that we had before making our decision to go with Dino.\nThanks again!", "ReviewDate": "2020-03-13T11:39:06Z"}, {"Author": "Ms A Dethlefsen", "Headline": "all items delivered as promised and…", "Ranking": "5", "Review": "all items delivered as promised and within 3 working days.", "ReviewDate": "2020-03-13T11:31:44Z"}, {"Author": "Vikki C", "Headline": "Quick service", "Ranking": "4", "Review": "Quick service. Poilte and friendly to deal with. Decking was fitted without compalint", "ReviewDate": "2020-03-12T14:34:02Z"}, {"Author": "John Dodd", "Headline": "Perfect in every way", "Ranking": "5", "Review": "Perfect in every way", "ReviewDate": "2020-03-10T17:47:31Z"}, {"Author": "Mrshifter", "Headline": "Excellent product and excellent service", "Ranking": "5", "Review": "Excellent product and excellent service", "ReviewDate": "2020-03-10T14:59:24Z"}, {"Author": "Cat woman ", "Headline": "Good stuff delivered on time", "Ranking": "5", "Review": "Good stuff delivered on time, like it👍", "ReviewDate": "2020-03-09T20:23:59Z"}, {"Author": "Leicestersectional", "Headline": "Great quality product", "Ranking": "5", "Review": "Great quality product, quick turn around and excellent customer service. Very happy!.", "ReviewDate": "2020-03-06T17:10:34Z"}, {"Author": "J Wood", "Headline": "Great communication when placing order", "Ranking": "5", "Review": "Great communication when placing order. Really quick delivery. Product is great quality and very easy to fit.\nWould definitely recommend the company and products.", "ReviewDate": "2020-03-06T14:54:52Z"}, {"Author": "Wendy Scullion", "Headline": "Service excellent", "Ranking": "5", "Review": "Service excellent \nComposite floor excellent", "ReviewDate": "2020-03-06T12:47:49Z"}, {"Author": "Tina Willey", "Headline": "NEEDED A FEW EXTRA BITS", "Ranking": "5", "Review": "NEEDED A FEW EXTRA BITS, ARRIVED NEXT DAY CANNOT FAULT THE SERVICE", "ReviewDate": "2020-03-06T06:45:02Z"}, {"Author": "Brian Coyle", "Headline": "Service was excellent", "Ranking": "5", "Review": "Service was excellent from ordering a sample to delivering the order, would recommend to friends & family", "ReviewDate": "2020-03-04T20:29:29Z"}, {"Author": "Mr Byrne", "Headline": "Great service", "Ranking": "4", "Review": "Great service,  great product and great price,  even better it's local.", "ReviewDate": "2020-03-02T22:18:40Z"}, {"Author": "Judith Wright", "Headline": "Very pleased with the decking and…", "Ranking": "5", "Review": "Very pleased with the decking and matching bullnose edging and fascia boards.  Would recommend it completely.  Good price.  Delivery within a week of placement of order but unfortunately rather pricey!\nMy builder also says it was a joy to lay.  Thank you.", "ReviewDate": "2020-02-21T14:53:48Z"}, {"Author": "Laurence Clark", "Headline": "Excellent", "Ranking": "5", "Review": "Very good experience with Dino Decking.  Excellent product, delivery and communication, perfect.", "ReviewDate": "2020-02-21T10:20:03Z"}, {"Author": "CHRISTINE TALBOT", "Headline": "Excellent service prompt deliverer…", "Ranking": "5", "Review": "Excellent service prompt deliverer pleased with decking", "ReviewDate": "2020-02-16T17:49:47Z"}, {"Author": "Barry", "Headline": "Bit of trouble with phone number but…", "Ranking": "5", "Review": "Bit of trouble with phone number but when sorted del on time driver very helpful decking looks just like samples", "ReviewDate": "2020-02-14T15:55:28Z"}, {"Author": "Mark", "Headline": "Prompt delivery service", "Ranking": "5", "Review": "Prompt delivery service", "ReviewDate": "2020-02-13T14:55:48Z"}, {"Author": "Karen ", "Headline": "I wanted composite decking instead of…", "Ranking": "5", "Review": "I wanted composite decking instead of traditional wood. I found dino was great quality and very reasonably priced.\nGreat,friendly and helpful service was provided and arrived when stated no distance too much for them as they travelled to Scotland.\nWould recommend them when looking for composite decking", "ReviewDate": "2020-02-13T14:25:23Z"}, {"Author": "Mr Peter Starling", "Headline": "Excellent service", "Ranking": "5", "Review": "Excellent service", "ReviewDate": "2020-02-13T07:58:23Z"}, {"Author": "Vivienne Gilholm", "Headline": "Fantastic service even when I forgot to…", "Ranking": "5", "Review": "Fantastic service even when I forgot to order a bag of fixings they were great. Thanks.", "ReviewDate": "2020-02-11T20:48:22Z"}, {"Author": "Chris Humphreys", "Headline": "Great service and superb quality…", "Ranking": "5", "Review": "Great service and superb quality boards. Thank you!", "ReviewDate": "2020-02-07T17:13:36Z"}, {"Author": "www.diydoctor.org.uk", "Headline": "Great guys and great product but…", "Ranking": "4", "Review": "Great guys and great product but shipping is a little on the expensive side. Other than that very pleased", "ReviewDate": "2020-02-07T14:37:18Z"}, {"Author": "GROUNDWORK HERTFORDSHIRE", "Headline": "Good stuff", "Ranking": "5", "Review": "Good stuff. Good communication. Good delivery", "ReviewDate": "2020-02-07T13:14:55Z"}, {"Author": "Gavin ", "Headline": "Great product", "Ranking": "5", "Review": "Great product. \nQuick delivery. \nVery helpful delivery driver.", "ReviewDate": "2020-02-03T15:26:00Z"}, {"Author": "jamie morgan", "Headline": "Good quality product but just a bit of…", "Ranking": "4", "Review": "Good quality product but just a bit of confusion with the delivery.\nWould definitely buy from them again", "ReviewDate": "2020-02-03T14:36:15Z"}, {"Author": "Richard Hayward", "Headline": "Very well made product  easy to use and…", "Ranking": "5", "Review": "Very well made product  easy to use and good nonslip finish. I have no hesitation recommending this company.", "ReviewDate": "2020-02-03T13:03:11Z"}, {"Author": "Pauline Parker", "Headline": "Excellent service", "Ranking": "5", "Review": "Excellent service, quick delivery and a really lovely delivery driver.  The decking is good quality and looks great.  Wish I had found it years ago1", "ReviewDate": "2020-02-02T18:53:57Z"}, {"Author": "Doug", "Headline": "Delighted with the decking", "Ranking": "4", "Review": "Delighted with the decking, looks very tidy with the 3mm gaps, all boards and edges matching colours, really good stainless torx headed screws.  Took a bit of practice to get some of the 4m boards to fit onto the previously fitted one, but soft faced hammer and length of soft wood and gentle persuasion and all looks good.  Great company to deal with, but delivery window of 13 hours could be improved.  The delivery driver was a lovely man, he had been delivering in the pouring rain and cold all day, but when he arrived just after 6pm he was as cheerful as could be, and then set off back to Wigan from near to Edinburgh.  If delivery window could be down to am or pm I would have given 5 stars.  Thank you Mathew and the rest of your guys.", "ReviewDate": "2020-02-02T12:43:12Z"}, {"Author": "Mr Glen Kehoe", "Headline": "Perfect customer service and the…", "Ranking": "5", "Review": "Perfect customer service and the product is top notch.", "ReviewDate": "2020-01-30T11:18:54Z"}, {"Author": "NIGEL MADEN", "Headline": "Great deck even better price", "Ranking": "5", "Review": "Great quality composite delivered super quick and at an affordable price", "ReviewDate": "2020-01-29T11:23:18Z"}, {"Author": "Kevin Eaton", "Headline": "Good stuff", "Ranking": "5", "Review": "Good stuff. Thanks k & G", "ReviewDate": "2020-01-24T17:01:24Z"}, {"Author": "RICHARD Firth", "Headline": "Excellent product delivered on time…", "Ranking": "5", "Review": "Excellent product delivered on time looks brilliant", "ReviewDate": "2020-01-24T09:48:19Z"}, {"Author": "Piotr", "Headline": "Absolutely great service from A to Z", "Ranking": "5", "Review": "Absolutely great service from A to Z. Fast and professional delivery and service.  Also the best price on the market and the highest quality.  Definitely I will use in the future.  I recommend it to anyone looking for a great product at the best price.", "ReviewDate": "2020-01-22T22:42:26Z"}, {"Author": ".K.E.Evans", "Headline": "Dino Decking review", "Ranking": "5", "Review": "Product exactly what was ordered, delivered on specified date and delivery men very helpful. A total satisfactory experience.", "ReviewDate": "2020-01-20T14:29:47Z"}, {"Author": "Jim Sadler", "Headline": "Great service and a quality product", "Ranking": "5", "Review": "Great service and a quality product", "ReviewDate": "2020-01-19T16:31:17Z"}, {"Author": "Thomas Lawrie", "Headline": "Additional Material Requirements", "Ranking": "5", "Review": "I required materials for an additional step.  I placed an order and materials were delivered next day, very impressed by the excellent service.", "ReviewDate": "2019-12-24T10:45:22Z"}, {"Author": "Robert  Jarvie", "Headline": "Great product, great delivery!", "Ranking": "5", "Review": "I had been interested in composite decking for some time and had a supplier in mind but delivery charges to Scotland were exorbitant. Did a trawl and found Dino Decking and gave them a try. Good price, good product and v reasonable delivery charge triggered at the amount of goods I required. Delivery was fast even to Perthshire. Job finished and looks great, couldn’t ask for more. Would recommend to anyone especially if you live north of Scotland’s Central Belt.", "ReviewDate": "2019-12-21T20:09:06Z"}, {"Author": "Carol Hunt", "Headline": "You did exactly what you said on the tin", "Ranking": "5", "Review": "You did exactly what you said on the tin", "ReviewDate": "2019-12-21T11:18:20Z"}, {"Author": "Sally Malin", "Headline": "Composite Decking", "Ranking": "5", "Review": "Easy ordering service. Competitively priced. Delivery efficient. Product perfect for needs.", "ReviewDate": "2019-12-16T21:04:22Z"}, {"Author": "Trevor Widdison", "Headline": "cannot fault the product or the service", "Ranking": "5", "Review": "cannot fault the product or the service", "ReviewDate": "2019-12-16T20:33:26Z"}, {"Author": "Neil Richardson", "Headline": "I highly recommend Dino Decking", "Ranking": "5", "Review": "I highly recommend Dino Decking, quality product, quick delivery and excellent customer service. Will use again!", "ReviewDate": "2019-12-15T17:26:25Z"}, {"Author": "Mr Johnston", "Headline": "Excellent product", "Ranking": "5", "Review": "From sending out a sample pack to delivering to my front door, everything was handled professionally. Cheapest price I found for what I was looking for. Product itself is better looking than other samples I received, woodgrain is more visible and pronounced, with in my opinion a better selection of colours than competitors. Have only had down for a month, so only time will tell how it keeps its appearance but I have confidence in it. Easy to install ( tutorials on YouTube). Would recommend Dino deck to anyone", "ReviewDate": "2019-12-15T09:51:24Z"}, {"Author": "Johnny London", "Headline": "Good service and good quality product", "Ranking": "4", "Review": "Good service and good quality product. My only complaint is that the colour choices are limited.", "ReviewDate": "2019-12-11T11:57:26Z"}, {"Author": "Sarah miles", "Headline": "Very happy", "Ranking": "5", "Review": "Very happy! Service straightforward, quick delivery and great product which was very easy to install!", "ReviewDate": "2019-12-06T14:37:48Z"}, {"Author": "Mr. Green", "Headline": "It was easy to order", "Ranking": "4", "Review": "It was easy to order, the delivery arrived on time. (They did deliver to the wrong house - small issue)\nThere was some damaged boards but they sent replacements within a few days.", "ReviewDate": "2019-12-04T05:36:08Z"}, {"Author": "Martin Ratcliffe", "Headline": "From ordering to delivery quick and…", "Ranking": "5", "Review": "From ordering to delivery quick and efficient.  The delivery driver was good at informing me of delivery ETA. He also pleasant and quick at off loading. \nThe product is great and easy to lay.", "ReviewDate": "2019-12-02T13:08:22Z"}, {"Author": "Stephen Lawson jackson", "Headline": "Customer service is good Poor product consistency", "Ranking": "3", "Review": "Customer service is good, however I needed additional boards but asked for 2.4 m lengths instead of the 4m I had been getting. This proved to be a mistake as the 2.4m lengths are slight different colour and nearly 2mm wider, doesn’t sound much I know but when the gaps are only 3 mm between each board then it has an effect on the all the boards around the wider boards. I emailed some pictures to Dino decking and all they suggested was get 4m and cut them down, .... speaks volumes  about quality and consistency. However this and the steep cost to have the additional s delivered, my advise is if you are going to buy from Dino decking then make sure it’s all the same lengths and from the same batch... The decking itself is easy to manage, time will tell and a few more seasons before the product is really tested. Other then this issue the Company responded quickly and I recommend getting the sample pack as the web colours can be different in reality.", "ReviewDate": "2019-11-28T20:09:01Z"}, {"Author": "Allan Dawes", "Headline": "Yes very satisfied thanks with product", "Ranking": "5", "Review": "Yes very satisfied thanks with product, only thing i would say is the fittings be sold in smaller quantities. Thanks", "ReviewDate": "2019-11-15T12:54:31Z"}, {"Author": "Howard Daly", "Headline": "Very good delivery", "Ranking": "5", "Review": "Very good delivery", "ReviewDate": "2019-11-15T12:50:13Z"}, {"Author": "CASH SALES", "Headline": "Staff was very helpful  and delivery…", "Ranking": "5", "Review": "Staff was very helpful  and delivery was also on time .would recommend them anytime.", "ReviewDate": "2019-11-14T08:54:00Z"}, {"Author": "customer", "Headline": "Really helpful,delivery arrived earlier…", "Ranking": "5", "Review": "Really helpful,delivery arrived earlier than scheduled. Had repeat orders that were dispatched quickly.", "ReviewDate": "2019-11-09T10:13:16Z"}, {"Author": "Mrs P  Stone", "Headline": "Second time purchase speaks volumes!", "Ranking": "5", "Review": "Second time dealing with Dino Decking. First rate product and service!", "ReviewDate": "2019-11-08T10:26:57Z"}, {"Author": "andrew kehoe", "Headline": "Fantastic service", "Ranking": "5", "Review": "Fantastic service. Very fast delivery would recommend all day long", "ReviewDate": "2019-11-05T17:34:48Z"}, {"Author": "MR & MRS TSAI", "Headline": "Excellent service", "Ranking": "5", "Review": "Excellent service.  Arrived when stated  Excellent communication.", "ReviewDate": "2019-11-04T20:10:52Z"}, {"Author": "Ash g", "Headline": "Great service and prompt delivery", "Ranking": "5", "Review": "Great service and prompt delivery", "ReviewDate": "2019-11-04T17:19:50Z"}, {"Author": "Jess", "Headline": "Fast delivery, great product", "Ranking": "5", "Review": "Delivered the next day. Great quality product and reasonable price", "ReviewDate": "2019-10-19T13:01:10Z"}, {"Author": "John Macneill", "Headline": "Effortless", "Ranking": "5", "Review": "Effortless so easy to find everything you need good quality", "ReviewDate": "2019-10-19T08:07:23Z"}, {"Author": "James Haywood", "Headline": "initial delivery was short of some…", "Ranking": "4", "Review": "initial delivery was short of some items that no one made us aware of, but the staff at Dino  helped us sort it quickly  and arranged for a quick delivery of the missing pieces", "ReviewDate": "2019-10-19T07:48:27Z"}, {"Author": "Suzanne Gardner", "Headline": "The decking boards are lovely BUT the…", "Ranking": "3", "Review": "The decking boards are lovely BUT the so-called joists at - I think £7.99 are not remotely able to bear weight. The are thin wobbly flexible little apologies - we have had a concrete built for them to sit on but they were so puny we have had to get concrete joists instead - really disappointing. Ditto the facing strips narrow and flimsy.", "ReviewDate": "2019-10-18T14:28:27Z"}, {"Author": "Paul Trevena", "Headline": "Great quality compound decking.", "Ranking": "5", "Review": "Great quality compound decking.", "ReviewDate": "2019-10-14T16:37:53Z"}, {"Author": "Carl", "Headline": "Great decking", "Ranking": "4", "Review": "Great decking, great wood effect and strong.\nIve only just installed it all last week so time will tell how durable but so far so good.\n\nOnly faults i had was, one. After spending over £1500 on the decking your still asked to pay extra for a set delivery date but i was able to work round this.\n\nTwo, a couple of my boards were chipped on the edges width ways but i over ordered for cuts so worked around this also.\n\nOver all im very happy with the decking so only time will tell how it holds up.", "ReviewDate": "2019-10-12T11:44:59Z"}, {"Author": "Stuart H", "Headline": "Very good service and very good quality…", "Ranking": "5", "Review": "Very good service and very good quality composite decking.\nAll questions that I asked were answered within 24 hours.\nHighly recommend Dino Decking.", "ReviewDate": "2019-10-12T06:36:27Z"}, {"Author": "Mal Pool", "Headline": "Easy to order staff very helpful…", "Ranking": "5", "Review": "Easy to order staff very helpful delivery on day driver phoned to let me know he was on way decking easy to install and looks great.", "ReviewDate": "2019-10-11T18:15:36Z"}, {"Author": "Shane Ravson", "Headline": "The sales guys were very helpful and…", "Ranking": "5", "Review": "The sales guys were very helpful and courteous. The delivery man was very accommodating too. Plenty of pre-delivery notification and aftercare support when called and enquired. The product is very impressive and of very high quality. Even my several builders were impressed by these composite deckings. It would be good to purchase other composite items like composite fences that would be matching to my decking. Overall happy with my purchase and will buy again!", "ReviewDate": "2019-10-11T16:04:16Z"}, {"Author": "Elizabeth Hill", "Headline": "Very pleased", "Ranking": "5", "Review": "Very pleased", "ReviewDate": "2019-10-11T15:56:12Z"}, {"Author": "Mrs Reeves", "Headline": "non Slip decking", "Ranking": "5", "Review": "Took a chance ordering my decking without getting any samples first but cannot be more pleased not only with the colour being exactly what I wanted but also with the quality.  The customer service has been excellent and any queries I had have been answered in a very professionally and friendly manner.  I found the calculation facility on the website excellent not only telling me how much decking was needed but also suggesting what fixings I needed.\nThere is no doubt I will be ordering again from Dino as I will be doing a second decking area as I work through remodelling my garden.  Also very competively priced with the 4m length decking an absolute must.", "ReviewDate": "2019-10-11T15:53:24Z"}, {"Author": "mark mcghee", "Headline": "very satisfied", "Ranking": "5", "Review": "Sales team very helpful and prompt with callback option. After sales and delivery teams excellent. Product quality is spot on and simple to install. Very satisfied", "ReviewDate": "2019-10-07T09:45:20Z"}, {"Author": "Mrs Robinson", "Headline": "Excellent quality decking", "Ranking": "5", "Review": "Excellent quality decking, delivered on time. Very helpful quote but unfortunately didn't allow for the side pieces so had to make the decking area a bit shorter", "ReviewDate": "2019-10-05T14:48:21Z"}, {"Author": "Jez Rhead ", "Headline": "Great service", "Ranking": "5", "Review": "Great service, good priced decking !!", "ReviewDate": "2019-10-05T09:13:31Z"}, {"Author": "Yandis", "Headline": "What a nightmare, left the delivery 20 houses away from my home.", "Ranking": "1", "Review": "What a nightmare! I paid £120 for delivery and the driver turn up 8pm at night and left 40 decking on a street 20 houses away. Driver refused to provide any help and said he got other stuff to deliver and just drove away. Was such a horrible experience. Can not believe how bad the service this company provided.", "ReviewDate": "2019-10-04T13:36:33Z"}, {"Author": "Barry", "Headline": "Great service", "Ranking": "5", "Review": "Good service and delivered on time.\nCo-operated well when dealing with our queries.", "ReviewDate": "2019-10-04T10:59:35Z"}, {"Author": "John ", "Headline": "A great product", "Ranking": "5", "Review": "A great product. Delivery and communication is excellent. They will be my new supplier of composite decking in the future", "ReviewDate": "2019-10-02T19:43:43Z"}, {"Author": "Sylvio Manickamchetty", "Headline": "Dino Decking were very helpful with…", "Ranking": "5", "Review": "Dino Decking were very helpful with garden project.Only wish they had installer Essex. Would highly recommend", "ReviewDate": "2019-09-23T07:35:12Z"}, {"Author": "Colin", "Headline": "Very good product", "Ranking": "5", "Review": "Very good product, need to review accessory quantities as can be slightly wrong in which case can have to wait for re-order to finish job.\nPrice competitive on main product but support feet for example can be on expensive side when compared to similar products.\nWill use again.", "ReviewDate": "2019-09-22T07:40:54Z"}, {"Author": "Miss Alice Rosam", "Headline": "Great quality decking, great service", "Ranking": "5", "Review": "The decking is great quality, looks fabulous and feels nice under foot - I used it to make a deck and a large planter going around the edge. I used the wooden effect side, the patterns on each board are all slightly different so there's not an issue with repetition in the wood grain. \n\nThey delivered when they said they would and the delivery person was very kind and helpful. Needed to order more fasteners after the main delivery and this was also delivered very quickly.", "ReviewDate": "2019-09-21T07:23:50Z"}, {"Author": "Barbara Wilkinson", "Headline": "Excellent service would have no problem…", "Ranking": "5", "Review": "Excellent service would have no problem using them again very professional", "ReviewDate": "2019-09-15T17:38:59Z"}, {"Author": "George rippin", "Headline": "I think it’s value for money", "Ranking": "4", "Review": "I think it’s value for money, I did find some of the boards 1/2 to 1mm out and with going with the 3mm gaps it did show 🤔\nThis was fitted on a balcony so when I do the decking on the ground floor I won’t be using it, got to say I thought Dino was a good experience and delivered in 4 days.", "ReviewDate": "2019-09-13T16:43:20Z"}, {"Author": "Wendy", "Headline": "Excellent decking", "Ranking": "5", "Review": "Excellent decking", "ReviewDate": "2019-09-13T11:02:40Z"}, {"Author": "Tony Hawkins", "Headline": "Excellent choice of supplier for my project.", "Ranking": "5", "Review": "Very pleased with Dino decking. I went to visit them at the centre in Wigan.  I brought my design and they helped me with ideas to improve the build. Prices are very competitive. I requested an earlier than normal slot and was accommodated. all items delivered on time. Build almost complete and has no issues with parts and quality of the products. Highly recommend these guys. they keep it simple. \nMr Hawkins - St Helens", "ReviewDate": "2019-09-13T09:51:44Z"}, {"Author": "David Sweeney", "Headline": "Wonderful service", "Ranking": "5", "Review": "Wonderful service. Extremely helpful, and quality of the product is absolutely excellent, even better than expected. Very satisfied", "ReviewDate": "2019-09-13T09:23:42Z"}, {"Author": "Stanley Miller", "Headline": "The decking looks great and at a great…", "Ranking": "5", "Review": "The decking looks great and at a great price. Delivery was quick and even as novices at laying decking we managed to fit without to many issues.", "ReviewDate": "2019-09-11T09:32:17Z"}, {"Author": "Linda Warner", "Headline": "Good quality decking at a reasonable price.", "Ranking": "5", "Review": "Good quality decking at a reasonable price delivered by friendly drivers", "ReviewDate": "2019-09-09T06:54:48Z"}, {"Author": "martin pearce", "Headline": "5 stars", "Ranking": "5", "Review": "Delivered on time, product quality very good, easy to fit. 5 stars", "ReviewDate": "2019-09-06T19:13:20Z"}, {"Author": "Mr Ian Stewart", "Headline": "Great service and product.", "Ranking": "5", "Review": "Great service and product.", "ReviewDate": "2019-09-06T09:43:16Z"}, {"Author": "Ian", "Headline": "Excellent product", "Ranking": "5", "Review": "Excellent product, delivered on time. Very good service.", "ReviewDate": "2019-08-23T15:45:07Z"}, {"Author": "Norman Blackburn", "Headline": "Good product", "Ranking": "5", "Review": "Good product at a fair price first class delivery service", "ReviewDate": "2019-08-11T15:53:43Z"}, {"Author": "anon", "Headline": "excellent decking and delivered quickly…", "Ranking": "5", "Review": "excellent decking and delivered quickly and left tidy in the yard even though we couldn't be there", "ReviewDate": "2019-08-09T20:05:27Z"}, {"Author": "Kevin Womack", "Headline": "Excellent quick delivery", "Ranking": "5", "Review": "Excellent quick delivery", "ReviewDate": "2019-08-06T17:33:22Z"}, {"Author": "cathryn", "Headline": "Fab decking", "Ranking": "5", "Review": "Thank you to Matthew ... Cannot fault their help and service and the decking looks great", "ReviewDate": "2019-08-06T09:09:26Z"}, {"Author": "Ravi", "Headline": "Great looking decking at a great price", "Ranking": "4", "Review": "In terms of price I was a little worried that because it was the cheapest I found compared to others - it would be inferior- but it's turned out to be great quality.\n\nWith two choices of finishes (standard decking look or wood grain) we went with the wood grain. Bought the grey finish and we're really pleased with it. The wood grain finish isn't slippy when wet either - seems to have a non-slip surface.\n\nI took about doing the job my self and it's easy to fit. Cutting the boards with a saw was all I needed.\n\nWhy I gave it 4 stars.\nThe extras that you buy could be better. The edging strip is a light grey colour (doesn't match the wood grain finish). The edging boards don't have a recessed edge to put the concealed fixings into - you have to screw fix on the face (I used spare boards with concealed fittings) Finally - the starter pack fixings is a bag with 100 fixings - I only used 10 - now got 90 spare. Could do with an option for a bag with less fixings?\n\nBut overall really pleased with the boards and finish. Would highly reccomend.", "ReviewDate": "2019-08-05T11:31:11Z"}, {"Author": "Colin Tunstall", "Headline": "Highly impressed with ordering &…", "Ranking": "5", "Review": "Highly impressed with ordering & delivery service. Product looks great, can't wait for the rain to stop to lay my decking and sit out for the summer!  Colin Tunstall", "ReviewDate": "2019-08-01T14:52:32Z"}, {"Author": "GLYN WOODCRAFT", "Headline": "good so far", "Ranking": "5", "Review": "We had been researching Composite Decking for some time before we decided to go with Dino Decking. Up to now it seems we made the right choice. Re delivery, from ordering to receiving the goods it took nine days, which was brilliant for us. The driver made the phone call an hour before he arrived, and true to his word he made it within the hour.The driver was a lovely guy and a credit to Dino .We are so pleased with the colour and weight of the boards, the fittings arrived the next day by courier as they said they would. I have yet to lay the decking, but I'm sure all will be good. Further updates will be posted , but so far Thank you Dino Decking.", "ReviewDate": "2019-07-30T19:41:52Z"}, {"Author": "kate lomax", "Headline": "I would highly recommend Dino Decking", "Ranking": "5", "Review": "I would highly recommend Dino Decking, I was given a date that the decking would be delivered and it was right on time,the delivery driver put it in my garden for me ,excellent customer service from the start,very pleased with how it looks", "ReviewDate": "2019-07-15T19:04:05Z"}, {"Author": "Alan", "Headline": "Great product", "Ranking": "3", "Review": "Great product, but delivery service let things down, ended up waiting in 1and a half days taking 2 days off work before materials actually arrived.\nNo follow up apology or communication given.", "ReviewDate": "2019-07-13T06:25:59Z"}, {"Author": "John Wilson", "Headline": "Price was the main thing going with…", "Ranking": "5", "Review": "Price was the main thing going with Dino decking wasn’t disappointed when the decking turned up on time very happy with service as well.", "ReviewDate": "2019-07-12T14:52:10Z"}, {"Author": "Marcus John", "Headline": "Researched various  decking suppliers…", "Ranking": "5", "Review": "Researched various  decking suppliers and dino decking seemed to be most recommended so went with them.\nGlad I did.\nVery straightforward. Everything worked. Phone always answerved when I rang with queries.\nGood product. \nRapid delivery.\nTen out of ten so far👍", "ReviewDate": "2019-07-11T16:49:12Z"}, {"Author": "frannk dinsdale", "Headline": "Excellent service Thanks", "Ranking": "5", "Review": "Excellent service best quality and price of all the Decking around.Deliveredl on time quality and quantity excellent.Just  ONE length and some off cuts left. Not enough for a rabbit hutch.Lucks superb", "ReviewDate": "2019-07-11T13:02:52Z"}, {"Author": "A&A ", "Headline": "We have recently decked an outdoor…", "Ranking": "4", "Review": "We have recently decked an outdoor covered area with Dino Decking. It looks a lovely product BUT scratches VERY easily. Also shows rubber marks from the feet of the chairs. Such a shame.", "ReviewDate": "2019-07-08T18:11:36Z"}, {"Author": "Keith Randall", "Headline": "Decking looks great the team worked out…best decking", "Ranking": "5", "Review": "Decking looks great the team worked out what I needed insulation was simple to do couldn’t have ask for a better product", "ReviewDate": "2019-07-08T09:16:33Z"}, {"Author": "Martyn Grover", "Headline": "Great customer service from the very…", "Ranking": "5", "Review": "Great customer service from the very beginnings when I asked for a sample box, right through to the day of my order delivery. The product itself is just what I wanted in terms of look, strength and longevity and is easy to work with; it looks great in place and has attracted many complimentary comments.  Would not hesitate to recommend this product for all these reasons but also its very competitive pricing.", "ReviewDate": "2019-07-06T07:15:00Z"}, {"Author": "Carl Bettenson", "Headline": "Good all round product and excellent…", "Ranking": "5", "Review": "Good all round product and excellent communication", "ReviewDate": "2019-07-02T17:49:46Z"}, {"Author": "Colin Wright", "Headline": "Delivered on time", "Ranking": "5", "Review": "Delivered on time, one bag of wrong clips sent but when I told them they put correct ones on next day delivery, very pleased with the decking.", "ReviewDate": "2019-07-02T17:41:55Z"}, {"Author": "Katie Eaton", "Headline": "Been using these guys for over a year…", "Ranking": "5", "Review": "Been using these guys for over a year now, excellent quality decking and great service.", "ReviewDate": "2019-06-27T10:36:03Z"}, {"Author": "Iain Cochrane", "Headline": "excellent service", "Ranking": "5", "Review": "excellent service.  material was out of stock but Dino Decking were very good at updating status and delivery was exactly as forecast.  We ran out of decking clips and Dino Decking were very responsive to organise next day delivery.", "ReviewDate": "2019-06-21T12:01:52Z"}, {"Author": "Sam Capes", "Headline": "Found the whole process really easy", "Ranking": "5", "Review": "Found the whole process really easy. Ordering over the phone was really easy. Just had my decking installed, my installer had used another wellknown decking which is more expensive previously and he said this was definitely comparable if not equal too. It looks fab, easy to clean. Just need to fill the space now. Delivery man was great. Man on phone who took the order was really pleasant.", "ReviewDate": "2019-06-20T21:52:43Z"}, {"Author": "STEPHEN GOSS", "Headline": "Very Good value for money product", "Ranking": "5", "Review": "Very Good value for money product ! Not yet fitted but excellent service from the Dino team from product selection through to delivery,will definitely reccomend.\nThanks Guys\nSteve Goss", "ReviewDate": "2019-06-20T05:12:56Z"}, {"Author": "Matt", "Headline": "Excellent customer service", "Ranking": "5", "Review": "Excellent customer service.  Chose the slate grey and very happy with it. Delivery was spot on.  The delivery guy works so hard and very friendly.  Deserves a pay rise :-)", "ReviewDate": "2019-06-19T12:38:00Z"}, {"Author": "Paul", "Headline": "Brilliant company", "Ranking": "5", "Review": "Brilliant company. Reliable and do exactly what they say . So refreshing. A lot of companies could learn from them", "ReviewDate": "2019-06-13T14:42:26Z"}, {"Author": "Nick Vose", "Headline": "Carlsberg does beer-Dino does decking!", "Ranking": "5", "Review": "Fast, efficient, good advice and great quality products.", "ReviewDate": "2019-06-10T18:27:48Z"}, {"Author": "Clive Jones", "Headline": "Appears to be a good quality product", "Ranking": "5", "Review": "Appears to be a good quality product. I bought 110 2.4 m boards in Ash, to deck 3 areas of my garden. Delivery a bit protracted but delivered as predicted with a VERY polite and hard-working , helpful driver.\nNever laid decking before (I'm 82)...... took 2 days to lay 35 boards to an area with none of the 4 sides either right angled or parallel to any other (so a lot of cutting) but keeping to the instructions produced (say it myself!) a brilliant, solid deck to a pre-prepared wooden joist support on adjustable plastic pedestals.\nGlad I didn't use composite joists.....all my wood was recycled from previous garden structures and the screws take beautifully in wood. Composite joists will split if you do not drill pilots for the screws...... about 300 extra operations on my 35 boards.\nThe joists for the other areas will be laid to reduce board waste to a minimum.....both other areas are rectangular, thank god!!!\nGood product, easy to use, looks good, good service......and the price was good too.. \nOne word......four stars is is no reflection on the product or on the company. If I'm happy with the durability after a suitable interval then I will upgrade the rating...... I have uprated to 5 STAR because the product is everythiong the supplier claims.......absolutely BRILLIANT!!!!", "ReviewDate": "2019-06-06T17:24:08Z"}, {"Author": "Dean Marshall", "Headline": "Great decking and great service!", "Ranking": "5", "Review": "The decking I ordered turned up on the day that was promised nice and early.", "ReviewDate": "2019-06-06T09:02:47Z"}, {"Author": "Debby Preston", "Headline": "Update    Very disappointed in the product", "Ranking": "1", "Review": "Very disappointed in the product. We purchased Ash colour , laid and was looking lovely , gave it a wash as it was dirty with sawdust and mud from the garden and it lost its colour. Very patchy took photographs showing the colour change compared to an off cut. Was told by customer services that expect it to fade by 30% in sunlight which I could have understood but it was only laid for a day! Held off before I reviewed but have had no further response from Dino decking. My advice would be to pay a few hundred pounds extra for quality if you can stretch to it. Very disappointed.\n\nIn response to your reply. Absolutely no chemical or any other detergent was used only cold water. I have emailed you as requested . Thank you", "ReviewDate": "2019-05-17T21:21:45Z"}, {"Author": "Richard Robinson", "Headline": "Very happy with the quality", "Ranking": "5", "Review": "Very happy with the quality, the sales person I dealt with even the delivery were prompt and helpful.\nVery good quality. \nI've been using composite de king some years now and I have found a quality supplier. \nWell done Dino", "ReviewDate": "2019-05-15T06:43:06Z"}, {"Author": "Scott Pollock", "Headline": "Change my order a few times but each…", "Ranking": "5", "Review": "Change my order a few times but each call was met with a friendly voice  and it wasn’t a problem", "ReviewDate": "2019-05-10T04:52:06Z"}, {"Author": "Paul Mardle", "Headline": "very good and efficient service would…", "Ranking": "5", "Review": "very good and efficient service would buy from them again", "ReviewDate": "2019-05-09T15:28:44Z"}, {"Author": "Mark Greer", "Headline": "Excellent quality", "Ranking": "5", "Review": "Excellent quality", "ReviewDate": "2019-05-09T14:44:19Z"}, {"Author": "Dan Penning", "Headline": "Excellent price and quality", "Ranking": "5", "Review": "Excellent price, and although the lead time on the decking was quite long the delivery date given was accurately kept to. This probably had more to do with the time of year (spring) being a busy time for ordering garden materials. \nDelivery was easy, lots of communication and the gentleman helped me carry all of the decking round to the back of the house. \nQuaility of the decking is good and the project looks very neat and tidy", "ReviewDate": "2019-05-08T20:36:38Z"}, {"Author": "Steve Phoenix", "Headline": "This is the first time I’ve used this…", "Ranking": "5", "Review": "This is the first time I’ve used this company and found it excellent.And would recommend it to all.", "ReviewDate": "2019-05-08T16:02:37Z"}, {"Author": "Bob Watson", "Headline": "good product .good service and good…", "Ranking": "5", "Review": "good product .good service and good delivery", "ReviewDate": "2019-05-08T11:33:26Z"}, {"Author": "Po", "Headline": "Excellent service excellent product", "Ranking": "5", "Review": "Excellent service excellent product", "ReviewDate": "2019-05-08T09:07:21Z"}, {"Author": "Jane", "Headline": "Black composite decking", "Ranking": "5", "Review": "The black decking is just what I wanted, there is a couple of observations, the company didn’t inform me when my order would be delivered, I got a phone call when it was on it’s way. To help with installation there could of been a drill bit for the screws for the plastic T spacers. Very happy with my purchase.", "ReviewDate": "2019-05-07T17:08:35Z"}, {"Author": "Dave Loder", "Headline": "The delivery came one week early", "Ranking": "5", "Review": "The delivery came one week early. We arranged delivery it was on time, the delivery driving was excellent ,he helped my husband unload all the boards, he even still had a smile on his face even thou it was 7.30 pm and still had two more deliveries to do that evening.\nWe are very impressed with the product!", "ReviewDate": "2019-05-06T15:19:13Z"}, {"Author": "Blair Hutchman", "Headline": "Great service friendly and helpfull", "Ranking": "5", "Review": "Great service friendly and helpfull. Delivery also very good, especially as we live in Northern Ireland. Would recommend to m6 friends.", "ReviewDate": "2019-05-03T12:57:11Z"}, {"Author": "Ian Brown", "Headline": "Good contact delivery as stated good…", "Ranking": "5", "Review": "Good contact delivery as stated good price", "ReviewDate": "2019-05-02T13:19:32Z"}, {"Author": "Terence Fuller", "Headline": "Great service", "Ranking": "5", "Review": "Very helpful delivery, great product, good price.", "ReviewDate": "2019-05-01T13:31:26Z"}, {"Author": "Danuta", "Headline": "Excellent", "Ranking": "5", "Review": "Highly recommended", "ReviewDate": "2019-05-01T13:21:10Z"}, {"Author": "Richard Avery", "Headline": "Really good service and great quality…", "Ranking": "4", "Review": "Really good service and great quality of decking, fairly easy to fit as well..", "ReviewDate": "2019-05-01T13:08:41Z"}, {"Author": "Nicholas", "Headline": "Great product BUT delivery is obscene", "Ranking": "3", "Review": "Only got samples where super fast at delivery was really pleased with the product. Was ready to order when realised the obscene delivery charge of £180 put me right off and still have no decking", "ReviewDate": "2019-04-03T19:55:06Z"}, {"Author": "David White", "Headline": "I am pleased with deckingordering and…", "Ranking": "5", "Review": "I am pleased with decking ordering and delivery was good. It would probably be a good idea to tell people ordering this product that you need a special star shaped screwdriver bit.", "ReviewDate": "2019-04-02T20:20:53Z"}, {"Author": "Shaun Gravett", "Headline": "Very good quality products", "Ranking": "5", "Review": "Very good quality products, very competitive prices", "ReviewDate": "2019-04-02T14:14:46Z"}, {"Author": "Matt Magill", "Headline": "Really impressed with this product and…", "Ranking": "5", "Review": "Really impressed with this product and company. \n\nHad a 25m2 area that was in need of a new look. Ordered the 4m length boards which are all exactly the same length, some others don’t offer this. Dinodecking support team were great at answering questions brought the process. Delivery was as promised. \n\nDecking itself is based on a very easy system. Highly recommend the composite joists. I used the 3mm fasteners which work really well and give a very nice look. Worth noting the screws need a star head. \n\nVery pleased with the final result.", "ReviewDate": "2019-03-31T19:28:01Z"}, {"Author": "Francisco Harrison", "Headline": "Great", "Ranking": "5", "Review": "Great composite decking", "ReviewDate": "2019-03-14T11:40:52Z"}, {"Author": "Michael Mason", "Headline": "very pleased with the service", "Ranking": "5", "Review": "very pleased with the service", "ReviewDate": "2019-03-13T22:07:48Z"}, {"Author": "Anthony Penfold", "Headline": "Decking was fantastic and easy to lay", "Ranking": "4", "Review": "Decking was fantastic and easy to lay, 3mm clips look good just make sure structure is good, 4 stars as edging is only 70 mm and does not look very good so used another deck for the edges", "ReviewDate": "2019-03-12T10:15:35Z"}, {"Author": "Graham Tuck", "Headline": "Prompt delivery of samples requested", "Ranking": "5", "Review": "Prompt delivery of samples requested", "ReviewDate": "2019-03-11T17:34:44Z"}, {"Author": "Rebecca F", "Headline": "I purchased the decking this week and I…", "Ranking": "5", "Review": "I purchased the decking this week and I was delivered the same week!! I had been recommended by a few people about this company, and I'm really pleased with the product and  service!", "ReviewDate": "2019-03-09T10:13:11Z"}, {"Author": "David Moore", "Headline": "Really good product delivery times we…", "Ranking": "4", "Review": "Really good product delivery times we found very difficult", "ReviewDate": "2019-03-08T18:36:21Z"}, {"Author": "Andrew Price", "Headline": "Great product", "Ranking": "5", "Review": "Great product", "ReviewDate": "2019-03-05T18:58:36Z"}, {"Author": "WDH", "Headline": "Nice boards shame about the facia boards", "Ranking": "1", "Review": "I wanted to order composite decking to cover an area of 85 square meters and needed facia boards but was told the only boards available for my £3600 decking would be ones that had to be glued on, which would not last five minutes and you do not even supply a glue for the job .", "ReviewDate": "2019-03-04T18:51:46Z"}, {"Author": "Neil Cartwright", "Headline": "Excellent service providing a free…", "Ranking": "5", "Review": "Excellent service providing a free sample pack of decking for consideration forva. Ew project", "ReviewDate": "2019-03-03T16:02:18Z"}, {"Author": "Michael thorne", "Headline": "We ordered samples and are very pleased…", "Ranking": "5", "Review": "We ordered samples and are very pleased with the quality of these and will be ordering the full amount very soon", "ReviewDate": "2019-03-03T16:00:26Z"}, {"Author": "chris", "Headline": "Excellent customer service and communication.", "Ranking": "5", "Review": "Excellent customer service and communication.", "ReviewDate": "2019-03-02T18:37:06Z"}, {"Author": "Nathan Brammer", "Headline": "The decking boards are a great product", "Ranking": "4", "Review": "The decking boards are a great product, communication and deliver is excellent the only negative it the plastic fastening clips. Very poor", "ReviewDate": "2019-02-15T07:14:52Z"}, {"Author": "Ashley Funnell", "Headline": "Great all round", "Ranking": "5", "Review": "Great prices, delivery and product, would recommend 👍", "ReviewDate": "2019-02-11T20:33:25Z"}, {"Author": "Phil Barley", "Headline": "Sample Pack", "Ranking": "5", "Review": "Only requested a sample pack, it arrived really quickly (within 48 hours). The samples are great, good choice of colours and they seem really strong. \nI'm certainly looking forwards to purchasing our decking from Dino if this is the level of service offered.", "ReviewDate": "2019-02-10T15:00:04Z"}, {"Author": "Alan", "Headline": "Great service and pricing very good", "Ranking": "5", "Review": "Great service and pricing very good. Product was perfect", "ReviewDate": "2019-02-07T22:34:14Z"}, {"Author": "Michael Davies", "Headline": "Quick delivery", "Ranking": "5", "Review": "Quick delivery, brilliant decking and unbeatable prices!", "ReviewDate": "2019-02-05T22:06:34Z"}, {"Author": "Keith Cluness", "Headline": "Excellent communication and everything…", "Ranking": "5", "Review": "Excellent communication and everything as stated.", "ReviewDate": "2019-02-05T09:01:34Z"}, {"Author": "Joe", "Headline": "Needed to purchase some angle trim…", "Ranking": "5", "Review": "Needed to purchase some angle trim quickly.  The guys were very helpful and I got things sorted quickly with no fuss.  Would recommend and would happily work with them again.", "ReviewDate": "2018-12-13T15:14:13Z"}, {"Author": "Colin Taylor", "Headline": "Hi  very good service from ordering to…", "Ranking": "5", "Review": "Hi  very good service from ordering to delivery", "ReviewDate": "2018-11-26T13:44:15Z"}, {"Author": "James Brownson", "Headline": "As a specialist company we produced a great project with these products.", "Ranking": "5", "Review": "Great products", "ReviewDate": "2018-11-08T15:18:38Z"}, {"Author": "Scott Lymath", "Headline": "Good boards, Fixings mediocre, late delivery.", "Ranking": "3", "Review": "Nice boards. Excellent price. Screw heads on hidden fasteners are quite poor which can make installation harder than it needs to be.\n\nDelivered 1 day late without any call from driver having waited in all day. No goodwill gesture offered for late delivery. Hence 3 stars.", "ReviewDate": "2018-10-30T20:03:56Z"}, {"Author": "Jill", "Headline": "Brilliant service", "Ranking": "4", "Review": "Brilliant service. And perfect team", "ReviewDate": "2018-10-30T07:45:00Z"}, {"Author": "Jane Gibson", "Headline": "Composite decking", "Ranking": "5", "Review": "Excellent product item as described and good value, looks class! Good communication n delivered on time! Many thanks definitely would use again!", "ReviewDate": "2018-10-04T18:28:28Z"}, {"Author": "Steve", "Headline": "Not without faults", "Ranking": "2", "Review": "Before ordering decking I enquired  whether the 100 pack sizes of clips could be split maybe into packs of 50 seems a bit excessive if you only need 450 of the 6mm and 50 of the starter clips to waste money for clips you don't need also a waste of resources was told only sold in 100's \nSo I decided to only to buy the 6mm clips which when I received my decking order they only came in plastic bags could easily be weighed out to suit a customer needs so that's one star rating dropped \nSecondly when I received my slate decking on a friday (33 x 4 metre lengths) and carried it all round to my back garden on the Saturday and laid it down just as a visual check found I had three different shades which resulted in a stripey look got in touch on Monday and got it re-delivered about 3.30pm on Wednesday so lost valuable time I had taken of work for the project and also had to carry it all back to the front of the house and the new decking back round to the back garden again so that's another star rating dropped\nThe screws are not very strong and will easily strip the head if your not careful \nSo in my case was let down wasted a lot of time and energy with a problem that should not have occurred and apology doesn't always cut it.\nAnother star dropped (would have dropped 1/2 star but can only do full stars)\nThen decking itself seems good only time will tell in its durability and looks\nThe delivery driver was great did receive good communication when delivery due and polite customer service\n\nReply\nI had three different shades which I supplied photos of and discussed over the phone so more than two batches mixed up?", "ReviewDate": "2018-10-03T21:35:36Z"}, {"Author": "Clive Holtman", "Headline": "Great product & fast customer service", "Ranking": "5", "Review": "Great product & fast customer service. Delivery charges need to be looked into.", "ReviewDate": "2018-10-02T15:50:36Z"}, {"Author": "Daniel Gallon", "Headline": "Great service and product highly…", "Ranking": "5", "Review": "Great service and product highly recommend", "ReviewDate": "2018-10-02T07:08:17Z"}, {"Author": "Steven Royle", "Headline": "I ordered 28 sq meters of the 4m Ash…", "Ranking": "5", "Review": "I ordered 28 sq meters of the 4m Ash decking along with 40 facia boards. Deleivery wasn’t a problem, they said five to ten days but would contact day before to confirm, this they did and the driver rang me half a hour before he arrived. I helped the unload.\nThe boards are great, look very smart, are non slip even when wet and on the smooth surface. Use the 3mm clips, they ensure you can’t see the retainers.\nOnly one thing I would mention, the facia boards are not very wide, 70mn, I had a 1m high deck and even with decent gaps, I used a lot of them. Could do with a wider board for around the sides. But all in all a great product and good service.\nP.S. I had a return of two bags of unused clips, no problems ! Straight refund to my card. Can’t fault the company !!", "ReviewDate": "2018-09-29T07:37:56Z"}, {"Author": "Ian Buchanan", "Headline": "Excellent service and product", "Ranking": "5", "Review": "Excellent service and product.  Delivered quickly and project cost less than anticipated.   Decking was very easy to work with and looks great.", "ReviewDate": "2018-09-28T16:26:38Z"}, {"Author": "Burt Hale", "Headline": "Good doing business with Dinodecking", "Ranking": "5", "Review": "Good doing business with Dinodecking. Gave us a quote and followed up. Answered our queries, and delivered promptly with no hassle. Really good decking too.", "ReviewDate": "2018-09-28T16:23:41Z"}, {"Author": "Darren Marshall", "Headline": "First class thank you", "Ranking": "5", "Review": "First class thank you", "ReviewDate": "2018-09-19T12:15:43Z"}, {"Author": "Ian ", "Headline": "Ordered composite decking which was at…", "Ranking": "4", "Review": "Ordered composite decking which was at a good price and the quality was great. Free delivery was an added bonus, only negative was it took over 2 weeks to arrive due to running out of stock which I had to ring to find out.", "ReviewDate": "2018-09-14T18:55:53Z"}, {"Author": "Mr McClean", "Headline": "WARNING -DO NOT PURCHASE FROM DINO…", "Ranking": "1", "Review": "WARNING -DO NOT PURCHASE FROM DINO DECKING !!! \nSadly for me I did . I spent over £2000 with them on their new “Silver “ decking Based on their sales literature claims that the decks Do not stain, do not fade,  have high definition wood grain effect and does not need maintenance . The reality is the polar opposite - within just weeks my decking has faded totally, has no grain effect left, is heavily stained (even after it rains ) and is covered in marks . It looks absolutely awful . \nThey are completely mis-selling this product , which is totally unfit for purpose and their customer service in response to my complaint is appalling and unacceptable. They have refused accept their product is substandard and unfit despite unequivocal photographic evidence to the contrary. \nMy dispute will be proceeding via legal means\nI have full photographic evidence of how awful this product is and the kind of service you can expect  & more than happy to share with anybody who is thinking about buying.\n* Dino have since had my contact details taken down - I wonder why !!! No worries - I’ll post them online anyway plus please see my profile picture for just a quick glimpse of what your decking would look like !!!", "ReviewDate": "2018-09-12T18:22:19Z"}, {"Author": "madeleine stevens", "Headline": "great company", "Ranking": "5", "Review": "Dino Decking was very helpful and delivery was quick and on time. The product is great quality and so easy to fit. Would very highly recommend", "ReviewDate": "2018-08-21T10:53:52Z"}, {"Author": "Timothy Waite", "Headline": "Great service", "Ranking": "5", "Review": "Great service, great product, really helpful when part of my order wasn't available, would recommend", "ReviewDate": "2018-08-15T11:24:19Z"}, {"Author": "James Brownson", "Headline": "Contractor purchase", "Ranking": "5", "Review": "Great product", "ReviewDate": "2018-08-15T10:46:15Z"}, {"Author": "Darren Grayson", "Headline": "Pretty good product and service.", "Ranking": "4", "Review": "I bought this product to replace my old timber boards and got the Silver colour. \n\nDino Decking answered some questions I had before ordering, and online ordering was straight-forward. The driver helped me unload the goods into my garage and everything I ordered was present.\n\nI've knocked a star off for two minor points:\n\nIt took a week to get a delivery date confirmed (delivery was about 7 working days from order) and on the day of delivery I only got word from the driver when he was 20 minutes away.  A message first thing in the morning with a rough indication of ETA would be useful, as it's a 12 hour delivery window.\n\nI ordered four edge strips and on all four there was a flaw visible as a crack in the composite, at the same place on each piece. As I was in a hurry to get my project finished I didn't raise this with Dino Decking though. It's only visible close up.\n\nMy only other minor nit-pick would be that the screws supplied with the clips aren't super tough. The heads can round easily. As there's so many to do I used a drill driver, which wasn't kind on them. You'll definitely need a few spares.\n\nThe boards are very easy to work with using standard woodworking tools. One edge of my deck goes up against an uneven wall and I was able to sculpt a matching shape to get a neat fit. The ease of working seems to come at the cost of a little robustness, it's really easy to mark the boards. My neighbour has recently fitted composite boards from another supplier and he had the same experience though, so I guess it's inherent in the product.\n\nA couple of weeks in and the initial new look has given way to reality. The patio furniture has been pushed about on it and it's marked up a fair bit. However I think in the long run it's going to fair better than timber would.\n\nI would use the product again.", "ReviewDate": "2018-08-14T11:59:51Z"}, {"Author": "LRB", "Headline": "Good product but unfortunately samples…", "Ranking": "4", "Review": "Good product but unfortunately samples arrived too late for my needs.", "ReviewDate": "2018-08-14T08:13:44Z"}, {"Author": "SHIRLEY", "Headline": "Superb customer experience.....superb…", "Ranking": "5", "Review": "Superb customer experience.....superb product and the customer service/sales team second to none...Thanks so much", "ReviewDate": "2018-08-09T13:06:07Z"}, {"Author": "Joanna Szymanska-Rusta", "Headline": "It is a fantastic decking", "Ranking": "5", "Review": "It is a fantastic decking", "ReviewDate": "2018-08-07T17:12:14Z"}, {"Author": "MATTHEW HIGGINS", "Headline": "Easy communication l", "Ranking": "5", "Review": "Easy communication  pleasant transaction. Would buy from them again!", "ReviewDate": "2018-08-06T21:40:33Z"}, {"Author": "O A JONES", "Headline": "Product is great as was the delivery", "Ranking": "5", "Review": "Product is great as was the delivery", "ReviewDate": "2018-08-03T11:20:49Z"}, {"Author": "Paul Mc Laughlin", "Headline": "Quality product.", "Ranking": "5", "Review": "Sent samples as promised, good product  would definately use again.", "ReviewDate": "2018-08-01T15:24:46Z"}, {"Author": "MR G WESTON", "Headline": "Excellent service no probs at all !", "Ranking": "5", "Review": "Excellent service no probs at all !! Good all round communications", "ReviewDate": "2018-08-01T12:18:31Z"}, {"Author": "Zak Burgess", "Headline": "Highly recommend", "Ranking": "5", "Review": "Already recommend to friends, best price and quality I found online.", "ReviewDate": "2018-08-01T09:46:57Z"}, {"Author": "Giz G", "Headline": "decking by clips and starter clips", "Ranking": "5", "Review": "great product and service - i bought he decking clips", "ReviewDate": "2018-08-01T09:29:16Z"}, {"Author": "william thompson", "Headline": "spot on to deal with", "Ranking": "5", "Review": "spot on to deal with", "ReviewDate": "2018-07-31T20:47:48Z"}, {"Author": "David Pearson", "Headline": "This decking is great to work with cuts…", "Ranking": "5", "Review": "This decking is great to work with cuts and planes like wood is durable has a great finish cleans up nice  and put plenty of joists in I over killed mine you get less spring in the boards overall very happy with the end result .", "ReviewDate": "2018-07-27T09:48:22Z"}, {"Author": "Albert Cieslik", "Headline": "Very good seller !", "Ranking": "5", "Review": "Very good seller !\nDelivery on time !\nProduct amaizing !\nThank You :)", "ReviewDate": "2018-07-26T12:26:41Z"}, {"Author": "Simon Bennett", "Headline": "Great quality product excellent…", "Ranking": "5", "Review": "Great quality product excellent delivery team highly recommend just check delivery lead times", "ReviewDate": "2018-07-24T17:35:26Z"}, {"Author": "Ken Mills", "Headline": "Very good product", "Ranking": "5", "Review": "Very good product would recommend Dino Decking to family & friends.", "ReviewDate": "2018-07-23T12:24:23Z"}, {"Author": "Jane Norton-smith", "Headline": "Great product", "Ranking": "5", "Review": "Great product, good service.\nEverything arrived as promised.", "ReviewDate": "2018-07-23T11:21:13Z"}, {"Author": "Claire Sago", "Headline": "Really pleased with regard to the…", "Ranking": "4", "Review": "Really pleased with regard to the service and the product, always a bit concerned when ordering online.  My husband fitted the decking and it looks fab !!!!", "ReviewDate": "2018-07-21T16:59:40Z"}, {"Author": "MARLBOROUGH PROPERTIES LTD", "Headline": "Excellent quality", "Ranking": "5", "Review": "Excellent quality \nWould highly recommend", "ReviewDate": "2018-07-19T18:15:28Z"}, {"Author": "Geoff Grinsted", "Headline": "Highly Recommended for Composite Decking", "Ranking": "5", "Review": "the composite decking is excellent. My questions were answered quickly and honestly and they recommended using the more expensive fasteners as this reduces the gap between the boards to around 3mm (effectively the fasteners are hidden) - this was brilliant advice.\nTwo boards turned up damaged on the edge but replacements were sent without any quibble. \nTransport company were excellent helping me get the 48 X 4m boards down 10 steps to the front of the house.\nOur guy laying the decking said its the best stuff he's seen / used and has taken the original samples to show other customers.\nHighly recommended", "ReviewDate": "2018-07-17T10:12:20Z"}, {"Author": "Karen Maloney", "Headline": "Decking looks fabulous", "Ranking": "5", "Review": "Decking looks fabulous. Easy to fit once we worked out where best to lay the cut edges. Only downside was delivery not arriving till 20.45 when I was told I was second delivery of the day and to expect it between 2 and 3 pm.", "ReviewDate": "2018-07-12T11:12:51Z"}, {"Author": "Mr Walker", "Headline": "Great product / prices / service", "Ranking": "5", "Review": "Great product\nGreat pricing\nGreat service\nEasy to use decking with the 6mm spacers.", "ReviewDate": "2018-07-11T13:42:36Z"}, {"Author": "Simon Mahony", "Headline": "Great price and service", "Ranking": "5", "Review": "Great price and service", "ReviewDate": "2018-07-09T16:26:41Z"}, {"Author": "kim Walker", "Headline": "Nice easy experience dealing with them", "Ranking": "5", "Review": "Nice easy experience dealing with them. Product is excellent.", "ReviewDate": "2018-07-09T09:25:59Z"}, {"Author": "rachel", "Headline": "Great item easy to contact.", "Ranking": "5", "Review": "Great item easy to contact.", "ReviewDate": "2018-06-18T10:22:31Z"}, {"Author": "E and M Landscaping ", "Headline": "Excellent product", "Ranking": "5", "Review": "Excellent product, brilliant service. The guys where very helpful on the phone with great customer service. The curtsy call before hand was great and the delivery drivers were prompt and delivered the decking carefully. Would recommend Dino decking", "ReviewDate": "2018-06-15T06:58:56Z"}, {"Author": "Mr Earl Martin", "Headline": "Good honest company", "Ranking": "5", "Review": "Great company to deal with . Well happy with the customer attention and my decking looks mint.", "ReviewDate": "2018-06-11T21:50:41Z"}, {"Author": "Sarah", "Headline": "Poor service", "Ranking": "2", "Review": "Poor service, firstly it was delivered a day late, secondly the wrong fixings were sent. The compromise was new fixings would be sent but would not be delivered until the following Monday. This was no use to us as we had a joiner booked to fit the decking, he was already delayed by a day because of the late arrival. I was told that the fixings that were sent are more expensive so they were ‘happy’ for us to use them at no extra charge, not really the point when they were the wrong size in the first place. The manager didn’t seem interested and his only suggestion was to cancel the order, any sort of apology was obviously too difficult. As a whole the customer service was terrible and I would not recommend this company, especially if you are expecting it to be on time with the correct product delivered. Disappointing as the product itself appears to be good quality, my advice would be to buy from elsewhere.", "ReviewDate": "2018-05-31T13:47:07Z"}, {"Author": "Nitesh Dudhia", "Headline": "Great product", "Ranking": "5", "Review": "Great product. Very pleased with it", "ReviewDate": "2018-05-29T19:00:28Z"}, {"Author": "Mike Donald", "Headline": "Great value and quality productsfantastic product and value", "Ranking": "5", "Review": "Great value and quality products, I searched to find a better deal and I couldn’t, delivery in around 10 days,  second order placed to extend my original project, about to order again for my own home as this is great!\nReal plus point is the non slip when wet!! Absolutely no issues when it was soaked, yet I slipped on my own traditional timber deck", "ReviewDate": "2018-05-22T20:36:43Z"}, {"Author": "Anonymous", "Headline": "Quality product at reasonable price", "Ranking": "5", "Review": "Quality product at reasonable price", "ReviewDate": "2018-05-21T16:05:37Z"}, {"Author": "M Sayers", "Headline": "Great product and service", "Ranking": "5", "Review": "The ordering process was straight forward and the communication from the company (via email and phone) was excellent. Kept up to date with the availability of the product and the delivery date. Very competitive pricing compared with other composite decking and the product is of good quality and was laid with ease. Would recommend Dino Decking.", "ReviewDate": "2018-05-18T09:57:01Z"}, {"Author": "Stephen Mellish", "Headline": "Goods delivered quickly", "Ranking": "5", "Review": "Goods delivered quickly, good value for money", "ReviewDate": "2018-05-17T10:43:55Z"}, {"Author": "sam tracy", "Headline": "Helpful service", "Ranking": "4", "Review": "Helpful service", "ReviewDate": "2018-05-09T12:30:19Z"}, {"Author": "Chris Baker", "Headline": "Very helpful", "Ranking": "5", "Review": "Very helpful. Solved all my problems and delivered on time.", "ReviewDate": "2018-05-02T11:31:04Z"}, {"Author": "Dan Gibson", "Headline": "Fantastic service from start to finish", "Ranking": "5", "Review": "Fantastic service from start to finish \nQuality product", "ReviewDate": "2018-04-27T08:29:13Z"}, {"Author": "Nigel Pether", "Headline": "Fantastic company very helpful  fast…", "Ranking": "5", "Review": "Fantastic company very helpful  fast delivery and cheap too\nThank you", "ReviewDate": "2018-04-26T04:51:47Z"}, {"Author": "Dean Keable", "Headline": "Great product, Savanna decking", "Ranking": "5", "Review": "Great product, good customer service and advice. Easy to lay, looks great, cheaper than  most and they do 4m lengths that nobody else seems to do.", "ReviewDate": "2018-04-24T17:26:05Z"}, {"Author": "Liz Burn", "Headline": "Beautiful decking and great service…", "Ranking": "5", "Review": "Beautiful decking and great service Thanks", "ReviewDate": "2018-04-23T16:09:12Z"}, {"Author": "jacqueline dawson", "Headline": "Dino decking", "Ranking": "5", "Review": "Lovely product, very pleased with the quality", "ReviewDate": "2018-04-05T17:41:39Z"}, {"Author": "Julie Smith", "Headline": "Prewarning of delivery", "Ranking": "3", "Review": "Ordering etc was brilliant.  Unfortunately I only received an email saying my order had been completed.  I was not told when it would be delivered.\nI look after my mum in Thursday's and Fridays and am not at home.  On Thursday night a Voicemail message came through from your driver saying he was delivering my tiles.  I had no idea where he had left them as my garden gate was locked.  I worried all night until I got home on Friday and found he had left them with my neighbour on Thursday, all 20 boxes.  It was embarrassing as I don't know my neighbour and her husband had carried them all round to his back garden so they were safe overnight.  We then had to carry them all back to my garden and they were heavy.  I had to ring my son to come round and help as I can't lift.    It would have been nice to have had pre warning or been asked on what day I would have liked them delivered.  I'm not sure who signed for them.\n\n\nREPLY TO YOUR ANSWER\nI did at the time of ordering ask to be informed by email as I spend a lot of time looking after my mum at her house and the mobile signal there is abysmal.    It was just unfortunate that you delivered on one of those days and if I had known it was going to be a Thursday I would have put you off until I was at home again.  I'm glad that you are now changing the system and thank you for your prompt reply.", "ReviewDate": "2018-04-01T10:45:18Z"}, {"Author": "Dewhirst", "Headline": "Excellent product", "Ranking": "5", "Review": "Excellent product, very helpful and answered all questions quickly. Product was delivered within a few days of ordering and after sales excellent - needed a few more clips.  Very good value for money product.", "ReviewDate": "2018-02-23T12:42:50Z"}, {"Author": "Alastair B Forest Hill", "Headline": "Good communication and went out of…", "Ranking": "5", "Review": "Good communication and went out of their way to get the product to me quickly.", "ReviewDate": "2018-02-22T19:52:39Z"}, {"Author": "JustPoo ", "Headline": "Excellent service and product.", "Ranking": "5", "Review": "Excellent service and product.", "ReviewDate": "2018-02-15T18:46:20Z"}, {"Author": "lime tree landscaping ", "Headline": "We always supply and install Dino…", "Ranking": "5", "Review": "We always supply and install Dino decking products, great value and only being round the corner from where we are based it’s ideal if we run short on items", "ReviewDate": "2020-11-17T17:23:23+00:00"}, {"Author": "liz Igrm", "Headline": "Great service", "Ranking": "5", "Review": "We are very pleased with our purchase. The delivery was quick and the man that delivered it was very helpful when it came to unload-66 4mtr planks later he helped my husband which was very welcome.\nCan't wait to see in installed.", "ReviewDate": "2020-11-10T12:53:58+00:00"}, {"Author": "Janet", "Headline": "Great product", "Ranking": "5", "Review": "Great product  - friendly and helpful staff! Would recommend,", "ReviewDate": "2020-11-10T08:16:28+00:00"}, {"Author": "Louise Ann Harvey", "Headline": "Great value, good service and looking good.", "Ranking": "4", "Review": "Our decking arrived safely and was unloaded for us by a friendly driver who had driven over four hours to get it to us! It is now all laid and looks fantastic.", "ReviewDate": "2020-11-09T21:37:15+00:00"}, {"Author": "P Bennett", "Headline": "Fantastic service, and helpful driver", "Ranking": "5", "Review": "Fantastic service, extremely fast delivery, the delivery driver Andrew was extremely helpful and very polite, would recommend to anyone,", "ReviewDate": "2020-11-09T18:57:38+00:00"}, {"Author": "Jim Hainey", "Headline": "total magic service", "Ranking": "5", "Review": "total magic service,    trims i desperatly needed arrived next day,,, couldn b happer with service   price    delivery   5stars", "ReviewDate": "2020-11-09T14:51:41+00:00"}, {"Author": "Mr Baker", "Headline": "Product Quality", "Ranking": "5", "Review": "The quality of the product is excellent as was service provision for follow queries. The product lacks the basic instructions for construction and such would have been of assistance during the build process.", "ReviewDate": "2020-11-09T13:51:09+00:00"}, {"Author": "Rick", "Headline": "Customer service = dreadful", "Ranking": "1", "Review": "Such a shame, seems like a good product but horrible company. Spent £1600 on decking and needed one more piece. Purchased the additional piece and I required it to be cut for collection. Charged me £8 to cut. Cut in half and not in dimensions I needed and refused to give me a correctly cut piece until payment was made for the £8. One star is for the product.", "ReviewDate": "2020-11-05T14:11:27+00:00"}, {"Author": "SG", "Headline": "Quick delivery", "Ranking": "5", "Review": "Quick delivery", "ReviewDate": "2020-11-04T09:36:13+00:00"}, {"Author": "Phil T.", "Headline": "Good service", "Ranking": "4", "Review": "Delivered what I wanted quickly and efficiently.", "ReviewDate": "2020-11-03T21:07:46+00:00"}, {"Author": "Mr Henry Tanner", "Headline": "Cannot Praise this Company Enough 🌟🌟🌟🌟🌟", "Ranking": "5", "Review": "Cannot praise this Company Enough. There Customer Service was Excellent!!!!!!.\nFriendly Helpful Staff and So Very Efficient and Courteous throughout.\nSpecial Mention to Sarah and Richard in ensuring everything was just right for us.. \nI Would Highly Recommend this Company and the product.. Great Quality and very Keenly priced..\nWill use again !!!!!!! \nThank you 🌟🌟🌟🌟🌟\n5 Stars All The Way.. \nChristine and Harry Tanner.. / Clydebank...", "ReviewDate": "2020-11-03T17:23:40+00:00"}, {"Author": "paul winter", "Headline": "Amazing service", "Ranking": "5", "Review": "Amazing service , all calls answered promptly, delivery on time , the quality of the product is top class \nThank you", "ReviewDate": "2020-11-03T10:22:38+00:00"}, {"Author": "Abbi Gary", "Headline": "Poor after service", "Ranking": "3", "Review": "Products delivered in great time and price was great but the after service was very poor. Was sent post caps that were not the same colour and didn’t seem interested in sorting out the issue. Would probably pay a bit more to get better service elsewhere in the future", "ReviewDate": "2020-10-29T21:18:29+00:00"}, {"Author": "Robert Ashton ", "Headline": "Decking project", "Ranking": "5", "Review": "Dino decking were very professional.  Ordering was easy and the office very helpful when I required help.", "ReviewDate": "2020-10-14T07:59:30+00:00"}, {"Author": "James Brady", "Headline": "It could be improved", "Ranking": "4", "Review": "It would have been a definitive five stars,good product,pleasant and efficient staff,the only faults were collar at bottom of posts are different shade from the posts itself and fitting the balustrade was very time consuming ,a better system should be implemented.", "ReviewDate": "2020-10-14T07:38:51+00:00"}, {"Author": "N hardy", "Headline": "Its just the weightin time the material", "Ranking": "4", "Review": "Its just the weightin time the material\nIs excellent", "ReviewDate": "2020-10-12T15:10:54+00:00"}, {"Author": "Mr Messom", "Headline": "Good service although Covid did make…", "Ranking": "5", "Review": "Good service although Covid did make delivery a little long winded.Product looks good.", "ReviewDate": "2020-10-09T14:57:14+00:00"}, {"Author": "Mr John Bowhay", "Headline": "Not all products are in stock all of…", "Ranking": "1", "Review": "Not all products are in stock all of the time, so you need to plan your purchase well ahead. Once the delivery date was notified it was duly delivered on that day. The driver  was exceptionally cheerful and very helpful in bringing the lengths of planking to my job site - not simply leaving them at the side of the road. The product looks really good, and I am looking forward to its installation, I think it is going to look great.", "ReviewDate": "2020-10-06T15:20:52+00:00"}, {"Author": "Steve", "Headline": "Ordered 10 3m composite joints", "Ranking": "5", "Review": "Ordered 10 3m composite joints - great value/price and arrived next day - excellent service! Definetly would use Dino Decking again!", "ReviewDate": "2020-10-05T13:02:02+00:00"}, {"Author": "Ben Hides", "Headline": "I had items missing off my delivery…", "Ranking": "3", "Review": "I had items missing off my delivery which affected the arranged start date for my customer", "ReviewDate": "2020-10-03T17:42:57+00:00"}]}